GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: RPOR20_21
#define RPOR20_21 RPOR20_21
RPOR20_21                                equ 0E1Ch
// bitfield definitions
RPOR20_21_RPO20R_POSN                    equ 0000h
RPOR20_21_RPO20R_POSITION                equ 0000h
RPOR20_21_RPO20R_SIZE                    equ 0004h
RPOR20_21_RPO20R_LENGTH                  equ 0004h
RPOR20_21_RPO20R_MASK                    equ 000Fh
RPOR20_21_RPO21R_POSN                    equ 0004h
RPOR20_21_RPO21R_POSITION                equ 0004h
RPOR20_21_RPO21R_SIZE                    equ 0004h
RPOR20_21_RPO21R_LENGTH                  equ 0004h
RPOR20_21_RPO21R_MASK                    equ 00F0h
RPOR20_21_RPO20R0_POSN                   equ 0000h
RPOR20_21_RPO20R0_POSITION               equ 0000h
RPOR20_21_RPO20R0_SIZE                   equ 0001h
RPOR20_21_RPO20R0_LENGTH                 equ 0001h
RPOR20_21_RPO20R0_MASK                   equ 0001h
RPOR20_21_RPO20R1_POSN                   equ 0001h
RPOR20_21_RPO20R1_POSITION               equ 0001h
RPOR20_21_RPO20R1_SIZE                   equ 0001h
RPOR20_21_RPO20R1_LENGTH                 equ 0001h
RPOR20_21_RPO20R1_MASK                   equ 0002h
RPOR20_21_RPO20R2_POSN                   equ 0002h
RPOR20_21_RPO20R2_POSITION               equ 0002h
RPOR20_21_RPO20R2_SIZE                   equ 0001h
RPOR20_21_RPO20R2_LENGTH                 equ 0001h
RPOR20_21_RPO20R2_MASK                   equ 0004h
RPOR20_21_RPO20R3_POSN                   equ 0003h
RPOR20_21_RPO20R3_POSITION               equ 0003h
RPOR20_21_RPO20R3_SIZE                   equ 0001h
RPOR20_21_RPO20R3_LENGTH                 equ 0001h
RPOR20_21_RPO20R3_MASK                   equ 0008h
RPOR20_21_RPO21R0_POSN                   equ 0004h
RPOR20_21_RPO21R0_POSITION               equ 0004h
RPOR20_21_RPO21R0_SIZE                   equ 0001h
RPOR20_21_RPO21R0_LENGTH                 equ 0001h
RPOR20_21_RPO21R0_MASK                   equ 0010h
RPOR20_21_RPO21R1_POSN                   equ 0005h
RPOR20_21_RPO21R1_POSITION               equ 0005h
RPOR20_21_RPO21R1_SIZE                   equ 0001h
RPOR20_21_RPO21R1_LENGTH                 equ 0001h
RPOR20_21_RPO21R1_MASK                   equ 0020h
RPOR20_21_RPO21R2_POSN                   equ 0006h
RPOR20_21_RPO21R2_POSITION               equ 0006h
RPOR20_21_RPO21R2_SIZE                   equ 0001h
RPOR20_21_RPO21R2_LENGTH                 equ 0001h
RPOR20_21_RPO21R2_MASK                   equ 0040h
RPOR20_21_RPO21R3_POSN                   equ 0007h
RPOR20_21_RPO21R3_POSITION               equ 0007h
RPOR20_21_RPO21R3_SIZE                   equ 0001h
RPOR20_21_RPO21R3_LENGTH                 equ 0001h
RPOR20_21_RPO21R3_MASK                   equ 0080h

// Register: RPOR22_23
#define RPOR22_23 RPOR22_23
RPOR22_23                                equ 0E1Dh
// bitfield definitions
RPOR22_23_RPO22R_POSN                    equ 0000h
RPOR22_23_RPO22R_POSITION                equ 0000h
RPOR22_23_RPO22R_SIZE                    equ 0004h
RPOR22_23_RPO22R_LENGTH                  equ 0004h
RPOR22_23_RPO22R_MASK                    equ 000Fh
RPOR22_23_RPO23R_POSN                    equ 0004h
RPOR22_23_RPO23R_POSITION                equ 0004h
RPOR22_23_RPO23R_SIZE                    equ 0004h
RPOR22_23_RPO23R_LENGTH                  equ 0004h
RPOR22_23_RPO23R_MASK                    equ 00F0h
RPOR22_23_RPO22R0_POSN                   equ 0000h
RPOR22_23_RPO22R0_POSITION               equ 0000h
RPOR22_23_RPO22R0_SIZE                   equ 0001h
RPOR22_23_RPO22R0_LENGTH                 equ 0001h
RPOR22_23_RPO22R0_MASK                   equ 0001h
RPOR22_23_RPO22R1_POSN                   equ 0001h
RPOR22_23_RPO22R1_POSITION               equ 0001h
RPOR22_23_RPO22R1_SIZE                   equ 0001h
RPOR22_23_RPO22R1_LENGTH                 equ 0001h
RPOR22_23_RPO22R1_MASK                   equ 0002h
RPOR22_23_RPO22R2_POSN                   equ 0002h
RPOR22_23_RPO22R2_POSITION               equ 0002h
RPOR22_23_RPO22R2_SIZE                   equ 0001h
RPOR22_23_RPO22R2_LENGTH                 equ 0001h
RPOR22_23_RPO22R2_MASK                   equ 0004h
RPOR22_23_RPO22R3_POSN                   equ 0003h
RPOR22_23_RPO22R3_POSITION               equ 0003h
RPOR22_23_RPO22R3_SIZE                   equ 0001h
RPOR22_23_RPO22R3_LENGTH                 equ 0001h
RPOR22_23_RPO22R3_MASK                   equ 0008h
RPOR22_23_RPO23R0_POSN                   equ 0004h
RPOR22_23_RPO23R0_POSITION               equ 0004h
RPOR22_23_RPO23R0_SIZE                   equ 0001h
RPOR22_23_RPO23R0_LENGTH                 equ 0001h
RPOR22_23_RPO23R0_MASK                   equ 0010h
RPOR22_23_RPO23R1_POSN                   equ 0005h
RPOR22_23_RPO23R1_POSITION               equ 0005h
RPOR22_23_RPO23R1_SIZE                   equ 0001h
RPOR22_23_RPO23R1_LENGTH                 equ 0001h
RPOR22_23_RPO23R1_MASK                   equ 0020h
RPOR22_23_RPO23R2_POSN                   equ 0006h
RPOR22_23_RPO23R2_POSITION               equ 0006h
RPOR22_23_RPO23R2_SIZE                   equ 0001h
RPOR22_23_RPO23R2_LENGTH                 equ 0001h
RPOR22_23_RPO23R2_MASK                   equ 0040h
RPOR22_23_RPO23R3_POSN                   equ 0007h
RPOR22_23_RPO23R3_POSITION               equ 0007h
RPOR22_23_RPO23R3_SIZE                   equ 0001h
RPOR22_23_RPO23R3_LENGTH                 equ 0001h
RPOR22_23_RPO23R3_MASK                   equ 0080h

// Register: RPOR24_25
#define RPOR24_25 RPOR24_25
RPOR24_25                                equ 0E1Eh
// bitfield definitions
RPOR24_25_RPO24R_POSN                    equ 0000h
RPOR24_25_RPO24R_POSITION                equ 0000h
RPOR24_25_RPO24R_SIZE                    equ 0004h
RPOR24_25_RPO24R_LENGTH                  equ 0004h
RPOR24_25_RPO24R_MASK                    equ 000Fh
RPOR24_25_RPO25R_POSN                    equ 0004h
RPOR24_25_RPO25R_POSITION                equ 0004h
RPOR24_25_RPO25R_SIZE                    equ 0004h
RPOR24_25_RPO25R_LENGTH                  equ 0004h
RPOR24_25_RPO25R_MASK                    equ 00F0h
RPOR24_25_RPO24R0_POSN                   equ 0000h
RPOR24_25_RPO24R0_POSITION               equ 0000h
RPOR24_25_RPO24R0_SIZE                   equ 0001h
RPOR24_25_RPO24R0_LENGTH                 equ 0001h
RPOR24_25_RPO24R0_MASK                   equ 0001h
RPOR24_25_RPO24R1_POSN                   equ 0001h
RPOR24_25_RPO24R1_POSITION               equ 0001h
RPOR24_25_RPO24R1_SIZE                   equ 0001h
RPOR24_25_RPO24R1_LENGTH                 equ 0001h
RPOR24_25_RPO24R1_MASK                   equ 0002h
RPOR24_25_RPO24R2_POSN                   equ 0002h
RPOR24_25_RPO24R2_POSITION               equ 0002h
RPOR24_25_RPO24R2_SIZE                   equ 0001h
RPOR24_25_RPO24R2_LENGTH                 equ 0001h
RPOR24_25_RPO24R2_MASK                   equ 0004h
RPOR24_25_RPO24R3_POSN                   equ 0003h
RPOR24_25_RPO24R3_POSITION               equ 0003h
RPOR24_25_RPO24R3_SIZE                   equ 0001h
RPOR24_25_RPO24R3_LENGTH                 equ 0001h
RPOR24_25_RPO24R3_MASK                   equ 0008h
RPOR24_25_RPO25R0_POSN                   equ 0004h
RPOR24_25_RPO25R0_POSITION               equ 0004h
RPOR24_25_RPO25R0_SIZE                   equ 0001h
RPOR24_25_RPO25R0_LENGTH                 equ 0001h
RPOR24_25_RPO25R0_MASK                   equ 0010h
RPOR24_25_RPO25R1_POSN                   equ 0005h
RPOR24_25_RPO25R1_POSITION               equ 0005h
RPOR24_25_RPO25R1_SIZE                   equ 0001h
RPOR24_25_RPO25R1_LENGTH                 equ 0001h
RPOR24_25_RPO25R1_MASK                   equ 0020h
RPOR24_25_RPO25R2_POSN                   equ 0006h
RPOR24_25_RPO25R2_POSITION               equ 0006h
RPOR24_25_RPO25R2_SIZE                   equ 0001h
RPOR24_25_RPO25R2_LENGTH                 equ 0001h
RPOR24_25_RPO25R2_MASK                   equ 0040h
RPOR24_25_RPO25R3_POSN                   equ 0007h
RPOR24_25_RPO25R3_POSITION               equ 0007h
RPOR24_25_RPO25R3_SIZE                   equ 0001h
RPOR24_25_RPO25R3_LENGTH                 equ 0001h
RPOR24_25_RPO25R3_MASK                   equ 0080h

// Register: RPOR26_27
#define RPOR26_27 RPOR26_27
RPOR26_27                                equ 0E1Fh
// bitfield definitions
RPOR26_27_RPO26R_POSN                    equ 0000h
RPOR26_27_RPO26R_POSITION                equ 0000h
RPOR26_27_RPO26R_SIZE                    equ 0004h
RPOR26_27_RPO26R_LENGTH                  equ 0004h
RPOR26_27_RPO26R_MASK                    equ 000Fh
RPOR26_27_RPO27R_POSN                    equ 0004h
RPOR26_27_RPO27R_POSITION                equ 0004h
RPOR26_27_RPO27R_SIZE                    equ 0004h
RPOR26_27_RPO27R_LENGTH                  equ 0004h
RPOR26_27_RPO27R_MASK                    equ 00F0h
RPOR26_27_RPO26R0_POSN                   equ 0000h
RPOR26_27_RPO26R0_POSITION               equ 0000h
RPOR26_27_RPO26R0_SIZE                   equ 0001h
RPOR26_27_RPO26R0_LENGTH                 equ 0001h
RPOR26_27_RPO26R0_MASK                   equ 0001h
RPOR26_27_RPO26R1_POSN                   equ 0001h
RPOR26_27_RPO26R1_POSITION               equ 0001h
RPOR26_27_RPO26R1_SIZE                   equ 0001h
RPOR26_27_RPO26R1_LENGTH                 equ 0001h
RPOR26_27_RPO26R1_MASK                   equ 0002h
RPOR26_27_RPO26R2_POSN                   equ 0002h
RPOR26_27_RPO26R2_POSITION               equ 0002h
RPOR26_27_RPO26R2_SIZE                   equ 0001h
RPOR26_27_RPO26R2_LENGTH                 equ 0001h
RPOR26_27_RPO26R2_MASK                   equ 0004h
RPOR26_27_RPO26R3_POSN                   equ 0003h
RPOR26_27_RPO26R3_POSITION               equ 0003h
RPOR26_27_RPO26R3_SIZE                   equ 0001h
RPOR26_27_RPO26R3_LENGTH                 equ 0001h
RPOR26_27_RPO26R3_MASK                   equ 0008h
RPOR26_27_RPO27R0_POSN                   equ 0004h
RPOR26_27_RPO27R0_POSITION               equ 0004h
RPOR26_27_RPO27R0_SIZE                   equ 0001h
RPOR26_27_RPO27R0_LENGTH                 equ 0001h
RPOR26_27_RPO27R0_MASK                   equ 0010h
RPOR26_27_RPO27R1_POSN                   equ 0005h
RPOR26_27_RPO27R1_POSITION               equ 0005h
RPOR26_27_RPO27R1_SIZE                   equ 0001h
RPOR26_27_RPO27R1_LENGTH                 equ 0001h
RPOR26_27_RPO27R1_MASK                   equ 0020h
RPOR26_27_RPO27R2_POSN                   equ 0006h
RPOR26_27_RPO27R2_POSITION               equ 0006h
RPOR26_27_RPO27R2_SIZE                   equ 0001h
RPOR26_27_RPO27R2_LENGTH                 equ 0001h
RPOR26_27_RPO27R2_MASK                   equ 0040h
RPOR26_27_RPO27R3_POSN                   equ 0007h
RPOR26_27_RPO27R3_POSITION               equ 0007h
RPOR26_27_RPO27R3_SIZE                   equ 0001h
RPOR26_27_RPO27R3_LENGTH                 equ 0001h
RPOR26_27_RPO27R3_MASK                   equ 0080h

// Register: RPOR28_29
#define RPOR28_29 RPOR28_29
RPOR28_29                                equ 0E20h
// bitfield definitions
RPOR28_29_RPO28R_POSN                    equ 0000h
RPOR28_29_RPO28R_POSITION                equ 0000h
RPOR28_29_RPO28R_SIZE                    equ 0004h
RPOR28_29_RPO28R_LENGTH                  equ 0004h
RPOR28_29_RPO28R_MASK                    equ 000Fh
RPOR28_29_RPO29R_POSN                    equ 0004h
RPOR28_29_RPO29R_POSITION                equ 0004h
RPOR28_29_RPO29R_SIZE                    equ 0004h
RPOR28_29_RPO29R_LENGTH                  equ 0004h
RPOR28_29_RPO29R_MASK                    equ 00F0h
RPOR28_29_RPO28R0_POSN                   equ 0000h
RPOR28_29_RPO28R0_POSITION               equ 0000h
RPOR28_29_RPO28R0_SIZE                   equ 0001h
RPOR28_29_RPO28R0_LENGTH                 equ 0001h
RPOR28_29_RPO28R0_MASK                   equ 0001h
RPOR28_29_RPO28R1_POSN                   equ 0001h
RPOR28_29_RPO28R1_POSITION               equ 0001h
RPOR28_29_RPO28R1_SIZE                   equ 0001h
RPOR28_29_RPO28R1_LENGTH                 equ 0001h
RPOR28_29_RPO28R1_MASK                   equ 0002h
RPOR28_29_RPO28R2_POSN                   equ 0002h
RPOR28_29_RPO28R2_POSITION               equ 0002h
RPOR28_29_RPO28R2_SIZE                   equ 0001h
RPOR28_29_RPO28R2_LENGTH                 equ 0001h
RPOR28_29_RPO28R2_MASK                   equ 0004h
RPOR28_29_RPO28R3_POSN                   equ 0003h
RPOR28_29_RPO28R3_POSITION               equ 0003h
RPOR28_29_RPO28R3_SIZE                   equ 0001h
RPOR28_29_RPO28R3_LENGTH                 equ 0001h
RPOR28_29_RPO28R3_MASK                   equ 0008h
RPOR28_29_RPO29R0_POSN                   equ 0004h
RPOR28_29_RPO29R0_POSITION               equ 0004h
RPOR28_29_RPO29R0_SIZE                   equ 0001h
RPOR28_29_RPO29R0_LENGTH                 equ 0001h
RPOR28_29_RPO29R0_MASK                   equ 0010h
RPOR28_29_RPO29R1_POSN                   equ 0005h
RPOR28_29_RPO29R1_POSITION               equ 0005h
RPOR28_29_RPO29R1_SIZE                   equ 0001h
RPOR28_29_RPO29R1_LENGTH                 equ 0001h
RPOR28_29_RPO29R1_MASK                   equ 0020h
RPOR28_29_RPO29R2_POSN                   equ 0006h
RPOR28_29_RPO29R2_POSITION               equ 0006h
RPOR28_29_RPO29R2_SIZE                   equ 0001h
RPOR28_29_RPO29R2_LENGTH                 equ 0001h
RPOR28_29_RPO29R2_MASK                   equ 0040h
RPOR28_29_RPO29R3_POSN                   equ 0007h
RPOR28_29_RPO29R3_POSITION               equ 0007h
RPOR28_29_RPO29R3_SIZE                   equ 0001h
RPOR28_29_RPO29R3_LENGTH                 equ 0001h
RPOR28_29_RPO29R3_MASK                   equ 0080h

// Register: RPOR30_31
#define RPOR30_31 RPOR30_31
RPOR30_31                                equ 0E21h
// bitfield definitions
RPOR30_31_RPO30R_POSN                    equ 0000h
RPOR30_31_RPO30R_POSITION                equ 0000h
RPOR30_31_RPO30R_SIZE                    equ 0004h
RPOR30_31_RPO30R_LENGTH                  equ 0004h
RPOR30_31_RPO30R_MASK                    equ 000Fh
RPOR30_31_RPO31R_POSN                    equ 0004h
RPOR30_31_RPO31R_POSITION                equ 0004h
RPOR30_31_RPO31R_SIZE                    equ 0004h
RPOR30_31_RPO31R_LENGTH                  equ 0004h
RPOR30_31_RPO31R_MASK                    equ 00F0h
RPOR30_31_RPO30R0_POSN                   equ 0000h
RPOR30_31_RPO30R0_POSITION               equ 0000h
RPOR30_31_RPO30R0_SIZE                   equ 0001h
RPOR30_31_RPO30R0_LENGTH                 equ 0001h
RPOR30_31_RPO30R0_MASK                   equ 0001h
RPOR30_31_RPO30R1_POSN                   equ 0001h
RPOR30_31_RPO30R1_POSITION               equ 0001h
RPOR30_31_RPO30R1_SIZE                   equ 0001h
RPOR30_31_RPO30R1_LENGTH                 equ 0001h
RPOR30_31_RPO30R1_MASK                   equ 0002h
RPOR30_31_RPO30R2_POSN                   equ 0002h
RPOR30_31_RPO30R2_POSITION               equ 0002h
RPOR30_31_RPO30R2_SIZE                   equ 0001h
RPOR30_31_RPO30R2_LENGTH                 equ 0001h
RPOR30_31_RPO30R2_MASK                   equ 0004h
RPOR30_31_RPO30R3_POSN                   equ 0003h
RPOR30_31_RPO30R3_POSITION               equ 0003h
RPOR30_31_RPO30R3_SIZE                   equ 0001h
RPOR30_31_RPO30R3_LENGTH                 equ 0001h
RPOR30_31_RPO30R3_MASK                   equ 0008h
RPOR30_31_RPO31R0_POSN                   equ 0004h
RPOR30_31_RPO31R0_POSITION               equ 0004h
RPOR30_31_RPO31R0_SIZE                   equ 0001h
RPOR30_31_RPO31R0_LENGTH                 equ 0001h
RPOR30_31_RPO31R0_MASK                   equ 0010h
RPOR30_31_RPO31R1_POSN                   equ 0005h
RPOR30_31_RPO31R1_POSITION               equ 0005h
RPOR30_31_RPO31R1_SIZE                   equ 0001h
RPOR30_31_RPO31R1_LENGTH                 equ 0001h
RPOR30_31_RPO31R1_MASK                   equ 0020h
RPOR30_31_RPO31R2_POSN                   equ 0006h
RPOR30_31_RPO31R2_POSITION               equ 0006h
RPOR30_31_RPO31R2_SIZE                   equ 0001h
RPOR30_31_RPO31R2_LENGTH                 equ 0001h
RPOR30_31_RPO31R2_MASK                   equ 0040h
RPOR30_31_RPO31R3_POSN                   equ 0007h
RPOR30_31_RPO31R3_POSITION               equ 0007h
RPOR30_31_RPO31R3_SIZE                   equ 0001h
RPOR30_31_RPO31R3_LENGTH                 equ 0001h
RPOR30_31_RPO31R3_MASK                   equ 0080h

// Register: RPOR32_33
#define RPOR32_33 RPOR32_33
RPOR32_33                                equ 0E22h
// bitfield definitions
RPOR32_33_RPO32R_POSN                    equ 0000h
RPOR32_33_RPO32R_POSITION                equ 0000h
RPOR32_33_RPO32R_SIZE                    equ 0004h
RPOR32_33_RPO32R_LENGTH                  equ 0004h
RPOR32_33_RPO32R_MASK                    equ 000Fh
RPOR32_33_RPO33R_POSN                    equ 0004h
RPOR32_33_RPO33R_POSITION                equ 0004h
RPOR32_33_RPO33R_SIZE                    equ 0004h
RPOR32_33_RPO33R_LENGTH                  equ 0004h
RPOR32_33_RPO33R_MASK                    equ 00F0h
RPOR32_33_RPO32R0_POSN                   equ 0000h
RPOR32_33_RPO32R0_POSITION               equ 0000h
RPOR32_33_RPO32R0_SIZE                   equ 0001h
RPOR32_33_RPO32R0_LENGTH                 equ 0001h
RPOR32_33_RPO32R0_MASK                   equ 0001h
RPOR32_33_RPO32R1_POSN                   equ 0001h
RPOR32_33_RPO32R1_POSITION               equ 0001h
RPOR32_33_RPO32R1_SIZE                   equ 0001h
RPOR32_33_RPO32R1_LENGTH                 equ 0001h
RPOR32_33_RPO32R1_MASK                   equ 0002h
RPOR32_33_RPO32R2_POSN                   equ 0002h
RPOR32_33_RPO32R2_POSITION               equ 0002h
RPOR32_33_RPO32R2_SIZE                   equ 0001h
RPOR32_33_RPO32R2_LENGTH                 equ 0001h
RPOR32_33_RPO32R2_MASK                   equ 0004h
RPOR32_33_RPO32R3_POSN                   equ 0003h
RPOR32_33_RPO32R3_POSITION               equ 0003h
RPOR32_33_RPO32R3_SIZE                   equ 0001h
RPOR32_33_RPO32R3_LENGTH                 equ 0001h
RPOR32_33_RPO32R3_MASK                   equ 0008h
RPOR32_33_RPO33R0_POSN                   equ 0004h
RPOR32_33_RPO33R0_POSITION               equ 0004h
RPOR32_33_RPO33R0_SIZE                   equ 0001h
RPOR32_33_RPO33R0_LENGTH                 equ 0001h
RPOR32_33_RPO33R0_MASK                   equ 0010h
RPOR32_33_RPO33R1_POSN                   equ 0005h
RPOR32_33_RPO33R1_POSITION               equ 0005h
RPOR32_33_RPO33R1_SIZE                   equ 0001h
RPOR32_33_RPO33R1_LENGTH                 equ 0001h
RPOR32_33_RPO33R1_MASK                   equ 0020h
RPOR32_33_RPO33R2_POSN                   equ 0006h
RPOR32_33_RPO33R2_POSITION               equ 0006h
RPOR32_33_RPO33R2_SIZE                   equ 0001h
RPOR32_33_RPO33R2_LENGTH                 equ 0001h
RPOR32_33_RPO33R2_MASK                   equ 0040h
RPOR32_33_RPO33R3_POSN                   equ 0007h
RPOR32_33_RPO33R3_POSITION               equ 0007h
RPOR32_33_RPO33R3_SIZE                   equ 0001h
RPOR32_33_RPO33R3_LENGTH                 equ 0001h
RPOR32_33_RPO33R3_MASK                   equ 0080h

// Register: RPOR34_35
#define RPOR34_35 RPOR34_35
RPOR34_35                                equ 0E23h
// bitfield definitions
RPOR34_35_RPO34R_POSN                    equ 0000h
RPOR34_35_RPO34R_POSITION                equ 0000h
RPOR34_35_RPO34R_SIZE                    equ 0004h
RPOR34_35_RPO34R_LENGTH                  equ 0004h
RPOR34_35_RPO34R_MASK                    equ 000Fh
RPOR34_35_RPO35R_POSN                    equ 0004h
RPOR34_35_RPO35R_POSITION                equ 0004h
RPOR34_35_RPO35R_SIZE                    equ 0004h
RPOR34_35_RPO35R_LENGTH                  equ 0004h
RPOR34_35_RPO35R_MASK                    equ 00F0h
RPOR34_35_RPO34R0_POSN                   equ 0000h
RPOR34_35_RPO34R0_POSITION               equ 0000h
RPOR34_35_RPO34R0_SIZE                   equ 0001h
RPOR34_35_RPO34R0_LENGTH                 equ 0001h
RPOR34_35_RPO34R0_MASK                   equ 0001h
RPOR34_35_RPO34R1_POSN                   equ 0001h
RPOR34_35_RPO34R1_POSITION               equ 0001h
RPOR34_35_RPO34R1_SIZE                   equ 0001h
RPOR34_35_RPO34R1_LENGTH                 equ 0001h
RPOR34_35_RPO34R1_MASK                   equ 0002h
RPOR34_35_RPO34R2_POSN                   equ 0002h
RPOR34_35_RPO34R2_POSITION               equ 0002h
RPOR34_35_RPO34R2_SIZE                   equ 0001h
RPOR34_35_RPO34R2_LENGTH                 equ 0001h
RPOR34_35_RPO34R2_MASK                   equ 0004h
RPOR34_35_RPO34R3_POSN                   equ 0003h
RPOR34_35_RPO34R3_POSITION               equ 0003h
RPOR34_35_RPO34R3_SIZE                   equ 0001h
RPOR34_35_RPO34R3_LENGTH                 equ 0001h
RPOR34_35_RPO34R3_MASK                   equ 0008h
RPOR34_35_RPO35R0_POSN                   equ 0004h
RPOR34_35_RPO35R0_POSITION               equ 0004h
RPOR34_35_RPO35R0_SIZE                   equ 0001h
RPOR34_35_RPO35R0_LENGTH                 equ 0001h
RPOR34_35_RPO35R0_MASK                   equ 0010h
RPOR34_35_RPO35R1_POSN                   equ 0005h
RPOR34_35_RPO35R1_POSITION               equ 0005h
RPOR34_35_RPO35R1_SIZE                   equ 0001h
RPOR34_35_RPO35R1_LENGTH                 equ 0001h
RPOR34_35_RPO35R1_MASK                   equ 0020h
RPOR34_35_RPO35R2_POSN                   equ 0006h
RPOR34_35_RPO35R2_POSITION               equ 0006h
RPOR34_35_RPO35R2_SIZE                   equ 0001h
RPOR34_35_RPO35R2_LENGTH                 equ 0001h
RPOR34_35_RPO35R2_MASK                   equ 0040h
RPOR34_35_RPO35R3_POSN                   equ 0007h
RPOR34_35_RPO35R3_POSITION               equ 0007h
RPOR34_35_RPO35R3_SIZE                   equ 0001h
RPOR34_35_RPO35R3_LENGTH                 equ 0001h
RPOR34_35_RPO35R3_MASK                   equ 0080h

