GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: RPINR36_37
#define RPINR36_37 RPINR36_37
RPINR36_37                               equ 0E3Ch
// bitfield definitions
RPINR36_37_CCP8R_POSN                    equ 0000h
RPINR36_37_CCP8R_POSITION                equ 0000h
RPINR36_37_CCP8R_SIZE                    equ 0004h
RPINR36_37_CCP8R_LENGTH                  equ 0004h
RPINR36_37_CCP8R_MASK                    equ 000Fh
RPINR36_37_CCP9R_POSN                    equ 0004h
RPINR36_37_CCP9R_POSITION                equ 0004h
RPINR36_37_CCP9R_SIZE                    equ 0004h
RPINR36_37_CCP9R_LENGTH                  equ 0004h
RPINR36_37_CCP9R_MASK                    equ 00F0h
RPINR36_37_CCP8R0_POSN                   equ 0000h
RPINR36_37_CCP8R0_POSITION               equ 0000h
RPINR36_37_CCP8R0_SIZE                   equ 0001h
RPINR36_37_CCP8R0_LENGTH                 equ 0001h
RPINR36_37_CCP8R0_MASK                   equ 0001h
RPINR36_37_CCP8R1_POSN                   equ 0001h
RPINR36_37_CCP8R1_POSITION               equ 0001h
RPINR36_37_CCP8R1_SIZE                   equ 0001h
RPINR36_37_CCP8R1_LENGTH                 equ 0001h
RPINR36_37_CCP8R1_MASK                   equ 0002h
RPINR36_37_CCP8R2_POSN                   equ 0002h
RPINR36_37_CCP8R2_POSITION               equ 0002h
RPINR36_37_CCP8R2_SIZE                   equ 0001h
RPINR36_37_CCP8R2_LENGTH                 equ 0001h
RPINR36_37_CCP8R2_MASK                   equ 0004h
RPINR36_37_CCP8R3_POSN                   equ 0003h
RPINR36_37_CCP8R3_POSITION               equ 0003h
RPINR36_37_CCP8R3_SIZE                   equ 0001h
RPINR36_37_CCP8R3_LENGTH                 equ 0001h
RPINR36_37_CCP8R3_MASK                   equ 0008h
RPINR36_37_CCP9R0_POSN                   equ 0004h
RPINR36_37_CCP9R0_POSITION               equ 0004h
RPINR36_37_CCP9R0_SIZE                   equ 0001h
RPINR36_37_CCP9R0_LENGTH                 equ 0001h
RPINR36_37_CCP9R0_MASK                   equ 0010h
RPINR36_37_CCP9R1_POSN                   equ 0005h
RPINR36_37_CCP9R1_POSITION               equ 0005h
RPINR36_37_CCP9R1_SIZE                   equ 0001h
RPINR36_37_CCP9R1_LENGTH                 equ 0001h
RPINR36_37_CCP9R1_MASK                   equ 0020h
RPINR36_37_CCP9R2_POSN                   equ 0006h
RPINR36_37_CCP9R2_POSITION               equ 0006h
RPINR36_37_CCP9R2_SIZE                   equ 0001h
RPINR36_37_CCP9R2_LENGTH                 equ 0001h
RPINR36_37_CCP9R2_MASK                   equ 0040h
RPINR36_37_CCP9R3_POSN                   equ 0007h
RPINR36_37_CCP9R3_POSITION               equ 0007h
RPINR36_37_CCP9R3_SIZE                   equ 0001h
RPINR36_37_CCP9R3_LENGTH                 equ 0001h
RPINR36_37_CCP9R3_MASK                   equ 0080h

// Register: RPINR38_39
#define RPINR38_39 RPINR38_39
RPINR38_39                               equ 0E3Dh
// bitfield definitions
RPINR38_39_CCP10R_POSN                   equ 0000h
RPINR38_39_CCP10R_POSITION               equ 0000h
RPINR38_39_CCP10R_SIZE                   equ 0004h
RPINR38_39_CCP10R_LENGTH                 equ 0004h
RPINR38_39_CCP10R_MASK                   equ 000Fh
RPINR38_39_T0CKIR_POSN                   equ 0004h
RPINR38_39_T0CKIR_POSITION               equ 0004h
RPINR38_39_T0CKIR_SIZE                   equ 0004h
RPINR38_39_T0CKIR_LENGTH                 equ 0004h
RPINR38_39_T0CKIR_MASK                   equ 00F0h
RPINR38_39_CCP10R0_POSN                  equ 0000h
RPINR38_39_CCP10R0_POSITION              equ 0000h
RPINR38_39_CCP10R0_SIZE                  equ 0001h
RPINR38_39_CCP10R0_LENGTH                equ 0001h
RPINR38_39_CCP10R0_MASK                  equ 0001h
RPINR38_39_CCP10R1_POSN                  equ 0001h
RPINR38_39_CCP10R1_POSITION              equ 0001h
RPINR38_39_CCP10R1_SIZE                  equ 0001h
RPINR38_39_CCP10R1_LENGTH                equ 0001h
RPINR38_39_CCP10R1_MASK                  equ 0002h
RPINR38_39_CCP10R2_POSN                  equ 0002h
RPINR38_39_CCP10R2_POSITION              equ 0002h
RPINR38_39_CCP10R2_SIZE                  equ 0001h
RPINR38_39_CCP10R2_LENGTH                equ 0001h
RPINR38_39_CCP10R2_MASK                  equ 0004h
RPINR38_39_CCP10R3_POSN                  equ 0003h
RPINR38_39_CCP10R3_POSITION              equ 0003h
RPINR38_39_CCP10R3_SIZE                  equ 0001h
RPINR38_39_CCP10R3_LENGTH                equ 0001h
RPINR38_39_CCP10R3_MASK                  equ 0008h
RPINR38_39_T0CKIR0_POSN                  equ 0004h
RPINR38_39_T0CKIR0_POSITION              equ 0004h
RPINR38_39_T0CKIR0_SIZE                  equ 0001h
RPINR38_39_T0CKIR0_LENGTH                equ 0001h
RPINR38_39_T0CKIR0_MASK                  equ 0010h
RPINR38_39_T0CKIR1_POSN                  equ 0005h
RPINR38_39_T0CKIR1_POSITION              equ 0005h
RPINR38_39_T0CKIR1_SIZE                  equ 0001h
RPINR38_39_T0CKIR1_LENGTH                equ 0001h
RPINR38_39_T0CKIR1_MASK                  equ 0020h
RPINR38_39_T0CKIR2_POSN                  equ 0006h
RPINR38_39_T0CKIR2_POSITION              equ 0006h
RPINR38_39_T0CKIR2_SIZE                  equ 0001h
RPINR38_39_T0CKIR2_LENGTH                equ 0001h
RPINR38_39_T0CKIR2_MASK                  equ 0040h
RPINR38_39_T0CKIR3_POSN                  equ 0007h
RPINR38_39_T0CKIR3_POSITION              equ 0007h
RPINR38_39_T0CKIR3_SIZE                  equ 0001h
RPINR38_39_T0CKIR3_LENGTH                equ 0001h
RPINR38_39_T0CKIR3_MASK                  equ 0080h

// Register: RPINR40_41
#define RPINR40_41 RPINR40_41
RPINR40_41                               equ 0E3Eh
// bitfield definitions
RPINR40_41_T1GR_POSN                     equ 0000h
RPINR40_41_T1GR_POSITION                 equ 0000h
RPINR40_41_T1GR_SIZE                     equ 0004h
RPINR40_41_T1GR_LENGTH                   equ 0004h
RPINR40_41_T1GR_MASK                     equ 000Fh
RPINR40_41_T1CKIR_POSN                   equ 0004h
RPINR40_41_T1CKIR_POSITION               equ 0004h
RPINR40_41_T1CKIR_SIZE                   equ 0004h
RPINR40_41_T1CKIR_LENGTH                 equ 0004h
RPINR40_41_T1CKIR_MASK                   equ 00F0h
RPINR40_41_T1GR0_POSN                    equ 0000h
RPINR40_41_T1GR0_POSITION                equ 0000h
RPINR40_41_T1GR0_SIZE                    equ 0001h
RPINR40_41_T1GR0_LENGTH                  equ 0001h
RPINR40_41_T1GR0_MASK                    equ 0001h
RPINR40_41_T1GR1_POSN                    equ 0001h
RPINR40_41_T1GR1_POSITION                equ 0001h
RPINR40_41_T1GR1_SIZE                    equ 0001h
RPINR40_41_T1GR1_LENGTH                  equ 0001h
RPINR40_41_T1GR1_MASK                    equ 0002h
RPINR40_41_T1GR2_POSN                    equ 0002h
RPINR40_41_T1GR2_POSITION                equ 0002h
RPINR40_41_T1GR2_SIZE                    equ 0001h
RPINR40_41_T1GR2_LENGTH                  equ 0001h
RPINR40_41_T1GR2_MASK                    equ 0004h
RPINR40_41_T1GR3_POSN                    equ 0003h
RPINR40_41_T1GR3_POSITION                equ 0003h
RPINR40_41_T1GR3_SIZE                    equ 0001h
RPINR40_41_T1GR3_LENGTH                  equ 0001h
RPINR40_41_T1GR3_MASK                    equ 0008h
RPINR40_41_T1CKIR0_POSN                  equ 0004h
RPINR40_41_T1CKIR0_POSITION              equ 0004h
RPINR40_41_T1CKIR0_SIZE                  equ 0001h
RPINR40_41_T1CKIR0_LENGTH                equ 0001h
RPINR40_41_T1CKIR0_MASK                  equ 0010h
RPINR40_41_T1CKIR1_POSN                  equ 0005h
RPINR40_41_T1CKIR1_POSITION              equ 0005h
RPINR40_41_T1CKIR1_SIZE                  equ 0001h
RPINR40_41_T1CKIR1_LENGTH                equ 0001h
RPINR40_41_T1CKIR1_MASK                  equ 0020h
RPINR40_41_T1CKIR2_POSN                  equ 0006h
RPINR40_41_T1CKIR2_POSITION              equ 0006h
RPINR40_41_T1CKIR2_SIZE                  equ 0001h
RPINR40_41_T1CKIR2_LENGTH                equ 0001h
RPINR40_41_T1CKIR2_MASK                  equ 0040h
RPINR40_41_T1CKIR3_POSN                  equ 0007h
RPINR40_41_T1CKIR3_POSITION              equ 0007h
RPINR40_41_T1CKIR3_SIZE                  equ 0001h
RPINR40_41_T1CKIR3_LENGTH                equ 0001h
RPINR40_41_T1CKIR3_MASK                  equ 0080h

// Register: RPINR42_43
#define RPINR42_43 RPINR42_43
RPINR42_43                               equ 0E3Fh
// bitfield definitions
RPINR42_43_T3GR_POSN                     equ 0000h
RPINR42_43_T3GR_POSITION                 equ 0000h
RPINR42_43_T3GR_SIZE                     equ 0004h
RPINR42_43_T3GR_LENGTH                   equ 0004h
RPINR42_43_T3GR_MASK                     equ 000Fh
RPINR42_43_T3CKIR_POSN                   equ 0004h
RPINR42_43_T3CKIR_POSITION               equ 0004h
RPINR42_43_T3CKIR_SIZE                   equ 0004h
RPINR42_43_T3CKIR_LENGTH                 equ 0004h
RPINR42_43_T3CKIR_MASK                   equ 00F0h
RPINR42_43_T3GR0_POSN                    equ 0000h
RPINR42_43_T3GR0_POSITION                equ 0000h
RPINR42_43_T3GR0_SIZE                    equ 0001h
RPINR42_43_T3GR0_LENGTH                  equ 0001h
RPINR42_43_T3GR0_MASK                    equ 0001h
RPINR42_43_T3GR1_POSN                    equ 0001h
RPINR42_43_T3GR1_POSITION                equ 0001h
RPINR42_43_T3GR1_SIZE                    equ 0001h
RPINR42_43_T3GR1_LENGTH                  equ 0001h
RPINR42_43_T3GR1_MASK                    equ 0002h
RPINR42_43_T3GR2_POSN                    equ 0002h
RPINR42_43_T3GR2_POSITION                equ 0002h
RPINR42_43_T3GR2_SIZE                    equ 0001h
RPINR42_43_T3GR2_LENGTH                  equ 0001h
RPINR42_43_T3GR2_MASK                    equ 0004h
RPINR42_43_T3GR3_POSN                    equ 0003h
RPINR42_43_T3GR3_POSITION                equ 0003h
RPINR42_43_T3GR3_SIZE                    equ 0001h
RPINR42_43_T3GR3_LENGTH                  equ 0001h
RPINR42_43_T3GR3_MASK                    equ 0008h
RPINR42_43_T3CKIR0_POSN                  equ 0004h
RPINR42_43_T3CKIR0_POSITION              equ 0004h
RPINR42_43_T3CKIR0_SIZE                  equ 0001h
RPINR42_43_T3CKIR0_LENGTH                equ 0001h
RPINR42_43_T3CKIR0_MASK                  equ 0010h
RPINR42_43_T3CKIR1_POSN                  equ 0005h
RPINR42_43_T3CKIR1_POSITION              equ 0005h
RPINR42_43_T3CKIR1_SIZE                  equ 0001h
RPINR42_43_T3CKIR1_LENGTH                equ 0001h
RPINR42_43_T3CKIR1_MASK                  equ 0020h
RPINR42_43_T3CKIR2_POSN                  equ 0006h
RPINR42_43_T3CKIR2_POSITION              equ 0006h
RPINR42_43_T3CKIR2_SIZE                  equ 0001h
RPINR42_43_T3CKIR2_LENGTH                equ 0001h
RPINR42_43_T3CKIR2_MASK                  equ 0040h
RPINR42_43_T3CKIR3_POSN                  equ 0007h
RPINR42_43_T3CKIR3_POSITION              equ 0007h
RPINR42_43_T3CKIR3_SIZE                  equ 0001h
RPINR42_43_T3CKIR3_LENGTH                equ 0001h
RPINR42_43_T3CKIR3_MASK                  equ 0080h

