GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: LCDDATA55
#define LCDDATA55 LCDDATA55
LCDDATA55                                equ 0EC5h
// bitfield definitions
LCDDATA55_S56C6_POSN                     equ 0000h
LCDDATA55_S56C6_POSITION                 equ 0000h
LCDDATA55_S56C6_SIZE                     equ 0001h
LCDDATA55_S56C6_LENGTH                   equ 0001h
LCDDATA55_S56C6_MASK                     equ 0001h
LCDDATA55_S57C6_POSN                     equ 0001h
LCDDATA55_S57C6_POSITION                 equ 0001h
LCDDATA55_S57C6_SIZE                     equ 0001h
LCDDATA55_S57C6_LENGTH                   equ 0001h
LCDDATA55_S57C6_MASK                     equ 0002h
LCDDATA55_S58C6_POSN                     equ 0002h
LCDDATA55_S58C6_POSITION                 equ 0002h
LCDDATA55_S58C6_SIZE                     equ 0001h
LCDDATA55_S58C6_LENGTH                   equ 0001h
LCDDATA55_S58C6_MASK                     equ 0004h
LCDDATA55_S59C6_POSN                     equ 0003h
LCDDATA55_S59C6_POSITION                 equ 0003h
LCDDATA55_S59C6_SIZE                     equ 0001h
LCDDATA55_S59C6_LENGTH                   equ 0001h
LCDDATA55_S59C6_MASK                     equ 0008h
LCDDATA55_S60C6_POSN                     equ 0004h
LCDDATA55_S60C6_POSITION                 equ 0004h
LCDDATA55_S60C6_SIZE                     equ 0001h
LCDDATA55_S60C6_LENGTH                   equ 0001h
LCDDATA55_S60C6_MASK                     equ 0010h
LCDDATA55_S61C6_POSN                     equ 0005h
LCDDATA55_S61C6_POSITION                 equ 0005h
LCDDATA55_S61C6_SIZE                     equ 0001h
LCDDATA55_S61C6_LENGTH                   equ 0001h
LCDDATA55_S61C6_MASK                     equ 0020h
LCDDATA55_S62C6_POSN                     equ 0006h
LCDDATA55_S62C6_POSITION                 equ 0006h
LCDDATA55_S62C6_SIZE                     equ 0001h
LCDDATA55_S62C6_LENGTH                   equ 0001h
LCDDATA55_S62C6_MASK                     equ 0040h
LCDDATA55_S63C6_POSN                     equ 0007h
LCDDATA55_S63C6_POSITION                 equ 0007h
LCDDATA55_S63C6_SIZE                     equ 0001h
LCDDATA55_S63C6_LENGTH                   equ 0001h
LCDDATA55_S63C6_MASK                     equ 0080h

// Register: LCDDATA56
#define LCDDATA56 LCDDATA56
LCDDATA56                                equ 0EC6h
// bitfield definitions
LCDDATA56_S00C7_POSN                     equ 0000h
LCDDATA56_S00C7_POSITION                 equ 0000h
LCDDATA56_S00C7_SIZE                     equ 0001h
LCDDATA56_S00C7_LENGTH                   equ 0001h
LCDDATA56_S00C7_MASK                     equ 0001h
LCDDATA56_S01C7_POSN                     equ 0001h
LCDDATA56_S01C7_POSITION                 equ 0001h
LCDDATA56_S01C7_SIZE                     equ 0001h
LCDDATA56_S01C7_LENGTH                   equ 0001h
LCDDATA56_S01C7_MASK                     equ 0002h
LCDDATA56_S02C7_POSN                     equ 0002h
LCDDATA56_S02C7_POSITION                 equ 0002h
LCDDATA56_S02C7_SIZE                     equ 0001h
LCDDATA56_S02C7_LENGTH                   equ 0001h
LCDDATA56_S02C7_MASK                     equ 0004h
LCDDATA56_S03C7_POSN                     equ 0003h
LCDDATA56_S03C7_POSITION                 equ 0003h
LCDDATA56_S03C7_SIZE                     equ 0001h
LCDDATA56_S03C7_LENGTH                   equ 0001h
LCDDATA56_S03C7_MASK                     equ 0008h
LCDDATA56_S04C7_POSN                     equ 0004h
LCDDATA56_S04C7_POSITION                 equ 0004h
LCDDATA56_S04C7_SIZE                     equ 0001h
LCDDATA56_S04C7_LENGTH                   equ 0001h
LCDDATA56_S04C7_MASK                     equ 0010h
LCDDATA56_S05C7_POSN                     equ 0005h
LCDDATA56_S05C7_POSITION                 equ 0005h
LCDDATA56_S05C7_SIZE                     equ 0001h
LCDDATA56_S05C7_LENGTH                   equ 0001h
LCDDATA56_S05C7_MASK                     equ 0020h
LCDDATA56_S06C7_POSN                     equ 0006h
LCDDATA56_S06C7_POSITION                 equ 0006h
LCDDATA56_S06C7_SIZE                     equ 0001h
LCDDATA56_S06C7_LENGTH                   equ 0001h
LCDDATA56_S06C7_MASK                     equ 0040h
LCDDATA56_S07C7_POSN                     equ 0007h
LCDDATA56_S07C7_POSITION                 equ 0007h
LCDDATA56_S07C7_SIZE                     equ 0001h
LCDDATA56_S07C7_LENGTH                   equ 0001h
LCDDATA56_S07C7_MASK                     equ 0080h

// Register: LCDDATA57
#define LCDDATA57 LCDDATA57
LCDDATA57                                equ 0EC7h
// bitfield definitions
LCDDATA57_S08C7_POSN                     equ 0000h
LCDDATA57_S08C7_POSITION                 equ 0000h
LCDDATA57_S08C7_SIZE                     equ 0001h
LCDDATA57_S08C7_LENGTH                   equ 0001h
LCDDATA57_S08C7_MASK                     equ 0001h
LCDDATA57_S09C7_POSN                     equ 0001h
LCDDATA57_S09C7_POSITION                 equ 0001h
LCDDATA57_S09C7_SIZE                     equ 0001h
LCDDATA57_S09C7_LENGTH                   equ 0001h
LCDDATA57_S09C7_MASK                     equ 0002h
LCDDATA57_S10C7_POSN                     equ 0002h
LCDDATA57_S10C7_POSITION                 equ 0002h
LCDDATA57_S10C7_SIZE                     equ 0001h
LCDDATA57_S10C7_LENGTH                   equ 0001h
LCDDATA57_S10C7_MASK                     equ 0004h
LCDDATA57_S11C7_POSN                     equ 0003h
LCDDATA57_S11C7_POSITION                 equ 0003h
LCDDATA57_S11C7_SIZE                     equ 0001h
LCDDATA57_S11C7_LENGTH                   equ 0001h
LCDDATA57_S11C7_MASK                     equ 0008h
LCDDATA57_S12C7_POSN                     equ 0004h
LCDDATA57_S12C7_POSITION                 equ 0004h
LCDDATA57_S12C7_SIZE                     equ 0001h
LCDDATA57_S12C7_LENGTH                   equ 0001h
LCDDATA57_S12C7_MASK                     equ 0010h
LCDDATA57_S13C7_POSN                     equ 0005h
LCDDATA57_S13C7_POSITION                 equ 0005h
LCDDATA57_S13C7_SIZE                     equ 0001h
LCDDATA57_S13C7_LENGTH                   equ 0001h
LCDDATA57_S13C7_MASK                     equ 0020h
LCDDATA57_S14C7_POSN                     equ 0006h
LCDDATA57_S14C7_POSITION                 equ 0006h
LCDDATA57_S14C7_SIZE                     equ 0001h
LCDDATA57_S14C7_LENGTH                   equ 0001h
LCDDATA57_S14C7_MASK                     equ 0040h
LCDDATA57_S15C7_POSN                     equ 0007h
LCDDATA57_S15C7_POSITION                 equ 0007h
LCDDATA57_S15C7_SIZE                     equ 0001h
LCDDATA57_S15C7_LENGTH                   equ 0001h
LCDDATA57_S15C7_MASK                     equ 0080h

// Register: LCDDATA58
#define LCDDATA58 LCDDATA58
LCDDATA58                                equ 0EC8h
// bitfield definitions
LCDDATA58_S16C7_POSN                     equ 0000h
LCDDATA58_S16C7_POSITION                 equ 0000h
LCDDATA58_S16C7_SIZE                     equ 0001h
LCDDATA58_S16C7_LENGTH                   equ 0001h
LCDDATA58_S16C7_MASK                     equ 0001h
LCDDATA58_S17C7_POSN                     equ 0001h
LCDDATA58_S17C7_POSITION                 equ 0001h
LCDDATA58_S17C7_SIZE                     equ 0001h
LCDDATA58_S17C7_LENGTH                   equ 0001h
LCDDATA58_S17C7_MASK                     equ 0002h
LCDDATA58_S18C7_POSN                     equ 0002h
LCDDATA58_S18C7_POSITION                 equ 0002h
LCDDATA58_S18C7_SIZE                     equ 0001h
LCDDATA58_S18C7_LENGTH                   equ 0001h
LCDDATA58_S18C7_MASK                     equ 0004h
LCDDATA58_S19C7_POSN                     equ 0003h
LCDDATA58_S19C7_POSITION                 equ 0003h
LCDDATA58_S19C7_SIZE                     equ 0001h
LCDDATA58_S19C7_LENGTH                   equ 0001h
LCDDATA58_S19C7_MASK                     equ 0008h
LCDDATA58_S20C7_POSN                     equ 0004h
LCDDATA58_S20C7_POSITION                 equ 0004h
LCDDATA58_S20C7_SIZE                     equ 0001h
LCDDATA58_S20C7_LENGTH                   equ 0001h
LCDDATA58_S20C7_MASK                     equ 0010h
LCDDATA58_S21C7_POSN                     equ 0005h
LCDDATA58_S21C7_POSITION                 equ 0005h
LCDDATA58_S21C7_SIZE                     equ 0001h
LCDDATA58_S21C7_LENGTH                   equ 0001h
LCDDATA58_S21C7_MASK                     equ 0020h
LCDDATA58_S22C7_POSN                     equ 0006h
LCDDATA58_S22C7_POSITION                 equ 0006h
LCDDATA58_S22C7_SIZE                     equ 0001h
LCDDATA58_S22C7_LENGTH                   equ 0001h
LCDDATA58_S22C7_MASK                     equ 0040h
LCDDATA58_S23C7_POSN                     equ 0007h
LCDDATA58_S23C7_POSITION                 equ 0007h
LCDDATA58_S23C7_SIZE                     equ 0001h
LCDDATA58_S23C7_LENGTH                   equ 0001h
LCDDATA58_S23C7_MASK                     equ 0080h

// Register: LCDDATA59
#define LCDDATA59 LCDDATA59
LCDDATA59                                equ 0EC9h
// bitfield definitions
LCDDATA59_S24C7_POSN                     equ 0000h
LCDDATA59_S24C7_POSITION                 equ 0000h
LCDDATA59_S24C7_SIZE                     equ 0001h
LCDDATA59_S24C7_LENGTH                   equ 0001h
LCDDATA59_S24C7_MASK                     equ 0001h
LCDDATA59_S25C7_POSN                     equ 0001h
LCDDATA59_S25C7_POSITION                 equ 0001h
LCDDATA59_S25C7_SIZE                     equ 0001h
LCDDATA59_S25C7_LENGTH                   equ 0001h
LCDDATA59_S25C7_MASK                     equ 0002h
LCDDATA59_S26C7_POSN                     equ 0002h
LCDDATA59_S26C7_POSITION                 equ 0002h
LCDDATA59_S26C7_SIZE                     equ 0001h
LCDDATA59_S26C7_LENGTH                   equ 0001h
LCDDATA59_S26C7_MASK                     equ 0004h
LCDDATA59_S27C7_POSN                     equ 0003h
LCDDATA59_S27C7_POSITION                 equ 0003h
LCDDATA59_S27C7_SIZE                     equ 0001h
LCDDATA59_S27C7_LENGTH                   equ 0001h
LCDDATA59_S27C7_MASK                     equ 0008h
LCDDATA59_S28C7_POSN                     equ 0004h
LCDDATA59_S28C7_POSITION                 equ 0004h
LCDDATA59_S28C7_SIZE                     equ 0001h
LCDDATA59_S28C7_LENGTH                   equ 0001h
LCDDATA59_S28C7_MASK                     equ 0010h
LCDDATA59_S29C7_POSN                     equ 0005h
LCDDATA59_S29C7_POSITION                 equ 0005h
LCDDATA59_S29C7_SIZE                     equ 0001h
LCDDATA59_S29C7_LENGTH                   equ 0001h
LCDDATA59_S29C7_MASK                     equ 0020h
LCDDATA59_S30C7_POSN                     equ 0006h
LCDDATA59_S30C7_POSITION                 equ 0006h
LCDDATA59_S30C7_SIZE                     equ 0001h
LCDDATA59_S30C7_LENGTH                   equ 0001h
LCDDATA59_S30C7_MASK                     equ 0040h
LCDDATA59_S31C7_POSN                     equ 0007h
LCDDATA59_S31C7_POSITION                 equ 0007h
LCDDATA59_S31C7_SIZE                     equ 0001h
LCDDATA59_S31C7_LENGTH                   equ 0001h
LCDDATA59_S31C7_MASK                     equ 0080h

