GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: REFO1CON
#define REFO1CON REFO1CON
REFO1CON                                 equ 0EE2h
// bitfield definitions
REFO1CON_ACTIVE_POSN                     equ 0000h
REFO1CON_ACTIVE_POSITION                 equ 0000h
REFO1CON_ACTIVE_SIZE                     equ 0001h
REFO1CON_ACTIVE_LENGTH                   equ 0001h
REFO1CON_ACTIVE_MASK                     equ 0001h
REFO1CON_DIVSWEN_POSN                    equ 0001h
REFO1CON_DIVSWEN_POSITION                equ 0001h
REFO1CON_DIVSWEN_SIZE                    equ 0001h
REFO1CON_DIVSWEN_LENGTH                  equ 0001h
REFO1CON_DIVSWEN_MASK                    equ 0002h
REFO1CON_ROSSLP_POSN                     equ 0003h
REFO1CON_ROSSLP_POSITION                 equ 0003h
REFO1CON_ROSSLP_SIZE                     equ 0001h
REFO1CON_ROSSLP_LENGTH                   equ 0001h
REFO1CON_ROSSLP_MASK                     equ 0008h
REFO1CON_ROOE_POSN                       equ 0004h
REFO1CON_ROOE_POSITION                   equ 0004h
REFO1CON_ROOE_SIZE                       equ 0001h
REFO1CON_ROOE_LENGTH                     equ 0001h
REFO1CON_ROOE_MASK                       equ 0010h
REFO1CON_ROSIDL_POSN                     equ 0005h
REFO1CON_ROSIDL_POSITION                 equ 0005h
REFO1CON_ROSIDL_SIZE                     equ 0001h
REFO1CON_ROSIDL_LENGTH                   equ 0001h
REFO1CON_ROSIDL_MASK                     equ 0020h
REFO1CON_ROON_POSN                       equ 0007h
REFO1CON_ROON_POSITION                   equ 0007h
REFO1CON_ROON_SIZE                       equ 0001h
REFO1CON_ROON_LENGTH                     equ 0001h
REFO1CON_ROON_MASK                       equ 0080h

// Register: MEMCON
#define MEMCON MEMCON
MEMCON                                   equ 0EE3h
// bitfield definitions
MEMCON_WM_POSN                           equ 0000h
MEMCON_WM_POSITION                       equ 0000h
MEMCON_WM_SIZE                           equ 0002h
MEMCON_WM_LENGTH                         equ 0002h
MEMCON_WM_MASK                           equ 0003h
MEMCON_WAIT_POSN                         equ 0004h
MEMCON_WAIT_POSITION                     equ 0004h
MEMCON_WAIT_SIZE                         equ 0002h
MEMCON_WAIT_LENGTH                       equ 0002h
MEMCON_WAIT_MASK                         equ 0030h
MEMCON_EBDIS_POSN                        equ 0007h
MEMCON_EBDIS_POSITION                    equ 0007h
MEMCON_EBDIS_SIZE                        equ 0001h
MEMCON_EBDIS_LENGTH                      equ 0001h
MEMCON_EBDIS_MASK                        equ 0080h
MEMCON_WM0_POSN                          equ 0000h
MEMCON_WM0_POSITION                      equ 0000h
MEMCON_WM0_SIZE                          equ 0001h
MEMCON_WM0_LENGTH                        equ 0001h
MEMCON_WM0_MASK                          equ 0001h
MEMCON_WM1_POSN                          equ 0001h
MEMCON_WM1_POSITION                      equ 0001h
MEMCON_WM1_SIZE                          equ 0001h
MEMCON_WM1_LENGTH                        equ 0001h
MEMCON_WM1_MASK                          equ 0002h
MEMCON_WAIT0_POSN                        equ 0004h
MEMCON_WAIT0_POSITION                    equ 0004h
MEMCON_WAIT0_SIZE                        equ 0001h
MEMCON_WAIT0_LENGTH                      equ 0001h
MEMCON_WAIT0_MASK                        equ 0010h
MEMCON_WAIT1_POSN                        equ 0005h
MEMCON_WAIT1_POSITION                    equ 0005h
MEMCON_WAIT1_SIZE                        equ 0001h
MEMCON_WAIT1_LENGTH                      equ 0001h
MEMCON_WAIT1_MASK                        equ 0020h

// Register: ODCON2
#define ODCON2 ODCON2
ODCON2                                   equ 0EEAh
// bitfield definitions
ODCON2_ECCP3OD_POSN                      equ 0000h
ODCON2_ECCP3OD_POSITION                  equ 0000h
ODCON2_ECCP3OD_SIZE                      equ 0001h
ODCON2_ECCP3OD_LENGTH                    equ 0001h
ODCON2_ECCP3OD_MASK                      equ 0001h
ODCON2_CCP4OD_POSN                       equ 0001h
ODCON2_CCP4OD_POSITION                   equ 0001h
ODCON2_CCP4OD_SIZE                       equ 0001h
ODCON2_CCP4OD_LENGTH                     equ 0001h
ODCON2_CCP4OD_MASK                       equ 0002h
ODCON2_CCP5OD_POSN                       equ 0002h
ODCON2_CCP5OD_POSITION                   equ 0002h
ODCON2_CCP5OD_SIZE                       equ 0001h
ODCON2_CCP5OD_LENGTH                     equ 0001h
ODCON2_CCP5OD_MASK                       equ 0004h
ODCON2_CCP6OD_POSN                       equ 0003h
ODCON2_CCP6OD_POSITION                   equ 0003h
ODCON2_CCP6OD_SIZE                       equ 0001h
ODCON2_CCP6OD_LENGTH                     equ 0001h
ODCON2_CCP6OD_MASK                       equ 0008h
ODCON2_CCP7OD_POSN                       equ 0004h
ODCON2_CCP7OD_POSITION                   equ 0004h
ODCON2_CCP7OD_SIZE                       equ 0001h
ODCON2_CCP7OD_LENGTH                     equ 0001h
ODCON2_CCP7OD_MASK                       equ 0010h
ODCON2_CCP8OD_POSN                       equ 0005h
ODCON2_CCP8OD_POSITION                   equ 0005h
ODCON2_CCP8OD_SIZE                       equ 0001h
ODCON2_CCP8OD_LENGTH                     equ 0001h
ODCON2_CCP8OD_MASK                       equ 0020h
ODCON2_CCP9OD_POSN                       equ 0006h
ODCON2_CCP9OD_POSITION                   equ 0006h
ODCON2_CCP9OD_SIZE                       equ 0001h
ODCON2_CCP9OD_LENGTH                     equ 0001h
ODCON2_CCP9OD_MASK                       equ 0040h
ODCON2_CCP10OD_POSN                      equ 0007h
ODCON2_CCP10OD_POSITION                  equ 0007h
ODCON2_CCP10OD_SIZE                      equ 0001h
ODCON2_CCP10OD_LENGTH                    equ 0001h
ODCON2_CCP10OD_MASK                      equ 0080h

// Register: ODCON1
#define ODCON1 ODCON1
ODCON1                                   equ 0EEBh
// bitfield definitions
ODCON1_SSP1OD_POSN                       equ 0000h
ODCON1_SSP1OD_POSITION                   equ 0000h
ODCON1_SSP1OD_SIZE                       equ 0001h
ODCON1_SSP1OD_LENGTH                     equ 0001h
ODCON1_SSP1OD_MASK                       equ 0001h
ODCON1_SSP2OD_POSN                       equ 0001h
ODCON1_SSP2OD_POSITION                   equ 0001h
ODCON1_SSP2OD_SIZE                       equ 0001h
ODCON1_SSP2OD_LENGTH                     equ 0001h
ODCON1_SSP2OD_MASK                       equ 0002h
ODCON1_USART1OD_POSN                     equ 0002h
ODCON1_USART1OD_POSITION                 equ 0002h
ODCON1_USART1OD_SIZE                     equ 0001h
ODCON1_USART1OD_LENGTH                   equ 0001h
ODCON1_USART1OD_MASK                     equ 0004h
ODCON1_USART2OD_POSN                     equ 0003h
ODCON1_USART2OD_POSITION                 equ 0003h
ODCON1_USART2OD_SIZE                     equ 0001h
ODCON1_USART2OD_LENGTH                   equ 0001h
ODCON1_USART2OD_MASK                     equ 0008h
ODCON1_USART3OD_POSN                     equ 0004h
ODCON1_USART3OD_POSITION                 equ 0004h
ODCON1_USART3OD_SIZE                     equ 0001h
ODCON1_USART3OD_LENGTH                   equ 0001h
ODCON1_USART3OD_MASK                     equ 0010h
ODCON1_USART4OD_POSN                     equ 0005h
ODCON1_USART4OD_POSITION                 equ 0005h
ODCON1_USART4OD_SIZE                     equ 0001h
ODCON1_USART4OD_LENGTH                   equ 0001h
ODCON1_USART4OD_MASK                     equ 0020h
ODCON1_ECCP1OD_POSN                      equ 0006h
ODCON1_ECCP1OD_POSITION                  equ 0006h
ODCON1_ECCP1OD_SIZE                      equ 0001h
ODCON1_ECCP1OD_LENGTH                    equ 0001h
ODCON1_ECCP1OD_MASK                      equ 0040h
ODCON1_ECCP2OD_POSN                      equ 0007h
ODCON1_ECCP2OD_POSITION                  equ 0007h
ODCON1_ECCP2OD_SIZE                      equ 0001h
ODCON1_ECCP2OD_LENGTH                    equ 0001h
ODCON1_ECCP2OD_MASK                      equ 0080h

// Register: MDCARL
#define MDCARL MDCARL
MDCARL                                   equ 0EECh
// bitfield definitions
MDCARL_MDCL_POSN                         equ 0000h
MDCARL_MDCL_POSITION                     equ 0000h
MDCARL_MDCL_SIZE                         equ 0004h
MDCARL_MDCL_LENGTH                       equ 0004h
MDCARL_MDCL_MASK                         equ 000Fh
MDCARL_MDCLSYNC_POSN                     equ 0005h
MDCARL_MDCLSYNC_POSITION                 equ 0005h
MDCARL_MDCLSYNC_SIZE                     equ 0001h
MDCARL_MDCLSYNC_LENGTH                   equ 0001h
MDCARL_MDCLSYNC_MASK                     equ 0020h
MDCARL_MDCLPOL_POSN                      equ 0006h
MDCARL_MDCLPOL_POSITION                  equ 0006h
MDCARL_MDCLPOL_SIZE                      equ 0001h
MDCARL_MDCLPOL_LENGTH                    equ 0001h
MDCARL_MDCLPOL_MASK                      equ 0040h
MDCARL_MDCLODIS_POSN                     equ 0007h
MDCARL_MDCLODIS_POSITION                 equ 0007h
MDCARL_MDCLODIS_SIZE                     equ 0001h
MDCARL_MDCLODIS_LENGTH                   equ 0001h
MDCARL_MDCLODIS_MASK                     equ 0080h
MDCARL_MDCL0_POSN                        equ 0000h
MDCARL_MDCL0_POSITION                    equ 0000h
MDCARL_MDCL0_SIZE                        equ 0001h
MDCARL_MDCL0_LENGTH                      equ 0001h
MDCARL_MDCL0_MASK                        equ 0001h
MDCARL_MDCL1_POSN                        equ 0001h
MDCARL_MDCL1_POSITION                    equ 0001h
MDCARL_MDCL1_SIZE                        equ 0001h
MDCARL_MDCL1_LENGTH                      equ 0001h
MDCARL_MDCL1_MASK                        equ 0002h
MDCARL_MDCL2_POSN                        equ 0002h
MDCARL_MDCL2_POSITION                    equ 0002h
MDCARL_MDCL2_SIZE                        equ 0001h
MDCARL_MDCL2_LENGTH                      equ 0001h
MDCARL_MDCL2_MASK                        equ 0004h
MDCARL_MDCL3_POSN                        equ 0003h
MDCARL_MDCL3_POSITION                    equ 0003h
MDCARL_MDCL3_SIZE                        equ 0001h
MDCARL_MDCL3_LENGTH                      equ 0001h
MDCARL_MDCL3_MASK                        equ 0008h

// Register: MDCARH
#define MDCARH MDCARH
MDCARH                                   equ 0EEDh
// bitfield definitions
MDCARH_MDCH_POSN                         equ 0000h
MDCARH_MDCH_POSITION                     equ 0000h
MDCARH_MDCH_SIZE                         equ 0004h
MDCARH_MDCH_LENGTH                       equ 0004h
MDCARH_MDCH_MASK                         equ 000Fh
MDCARH_MDCHSYNC_POSN                     equ 0005h
MDCARH_MDCHSYNC_POSITION                 equ 0005h
MDCARH_MDCHSYNC_SIZE                     equ 0001h
MDCARH_MDCHSYNC_LENGTH                   equ 0001h
MDCARH_MDCHSYNC_MASK                     equ 0020h
MDCARH_MDCHPOL_POSN                      equ 0006h
MDCARH_MDCHPOL_POSITION                  equ 0006h
MDCARH_MDCHPOL_SIZE                      equ 0001h
MDCARH_MDCHPOL_LENGTH                    equ 0001h
MDCARH_MDCHPOL_MASK                      equ 0040h
MDCARH_MDCHODIS_POSN                     equ 0007h
MDCARH_MDCHODIS_POSITION                 equ 0007h
MDCARH_MDCHODIS_SIZE                     equ 0001h
MDCARH_MDCHODIS_LENGTH                   equ 0001h
MDCARH_MDCHODIS_MASK                     equ 0080h
MDCARH_MDCH0_POSN                        equ 0000h
MDCARH_MDCH0_POSITION                    equ 0000h
MDCARH_MDCH0_SIZE                        equ 0001h
MDCARH_MDCH0_LENGTH                      equ 0001h
MDCARH_MDCH0_MASK                        equ 0001h
MDCARH_MDCH1_POSN                        equ 0001h
MDCARH_MDCH1_POSITION                    equ 0001h
MDCARH_MDCH1_SIZE                        equ 0001h
MDCARH_MDCH1_LENGTH                      equ 0001h
MDCARH_MDCH1_MASK                        equ 0002h
MDCARH_MDCH2_POSN                        equ 0002h
MDCARH_MDCH2_POSITION                    equ 0002h
MDCARH_MDCH2_SIZE                        equ 0001h
MDCARH_MDCH2_LENGTH                      equ 0001h
MDCARH_MDCH2_MASK                        equ 0004h
MDCARH_MDCH3_POSN                        equ 0003h
MDCARH_MDCH3_POSITION                    equ 0003h
MDCARH_MDCH3_SIZE                        equ 0001h
MDCARH_MDCH3_LENGTH                      equ 0001h
MDCARH_MDCH3_MASK                        equ 0008h

