GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: CTMUCON3
#define CTMUCON3 CTMUCON3
CTMUCON3                                 equ 0EF6h
// bitfield definitions
CTMUCON3_EDG2SEL_POSN                    equ 0002h
CTMUCON3_EDG2SEL_POSITION                equ 0002h
CTMUCON3_EDG2SEL_SIZE                    equ 0004h
CTMUCON3_EDG2SEL_LENGTH                  equ 0004h
CTMUCON3_EDG2SEL_MASK                    equ 003Ch
CTMUCON3_EDG2POL_POSN                    equ 0006h
CTMUCON3_EDG2POL_POSITION                equ 0006h
CTMUCON3_EDG2POL_SIZE                    equ 0001h
CTMUCON3_EDG2POL_LENGTH                  equ 0001h
CTMUCON3_EDG2POL_MASK                    equ 0040h
CTMUCON3_EDG2EN_POSN                     equ 0007h
CTMUCON3_EDG2EN_POSITION                 equ 0007h
CTMUCON3_EDG2EN_SIZE                     equ 0001h
CTMUCON3_EDG2EN_LENGTH                   equ 0001h
CTMUCON3_EDG2EN_MASK                     equ 0080h
CTMUCON3_EDG2SEL0_POSN                   equ 0002h
CTMUCON3_EDG2SEL0_POSITION               equ 0002h
CTMUCON3_EDG2SEL0_SIZE                   equ 0001h
CTMUCON3_EDG2SEL0_LENGTH                 equ 0001h
CTMUCON3_EDG2SEL0_MASK                   equ 0004h
CTMUCON3_EDG2SEL1_POSN                   equ 0003h
CTMUCON3_EDG2SEL1_POSITION               equ 0003h
CTMUCON3_EDG2SEL1_SIZE                   equ 0001h
CTMUCON3_EDG2SEL1_LENGTH                 equ 0001h
CTMUCON3_EDG2SEL1_MASK                   equ 0008h
CTMUCON3_EDG2SEL2_POSN                   equ 0004h
CTMUCON3_EDG2SEL2_POSITION               equ 0004h
CTMUCON3_EDG2SEL2_SIZE                   equ 0001h
CTMUCON3_EDG2SEL2_LENGTH                 equ 0001h
CTMUCON3_EDG2SEL2_MASK                   equ 0010h
CTMUCON3_EDG2SEL3_POSN                   equ 0005h
CTMUCON3_EDG2SEL3_POSITION               equ 0005h
CTMUCON3_EDG2SEL3_SIZE                   equ 0001h
CTMUCON3_EDG2SEL3_LENGTH                 equ 0001h
CTMUCON3_EDG2SEL3_MASK                   equ 0020h

// Register: CTMUCON2
#define CTMUCON2 CTMUCON2
CTMUCON2                                 equ 0EF7h
// bitfield definitions
CTMUCON2_IRNG_POSN                       equ 0000h
CTMUCON2_IRNG_POSITION                   equ 0000h
CTMUCON2_IRNG_SIZE                       equ 0002h
CTMUCON2_IRNG_LENGTH                     equ 0002h
CTMUCON2_IRNG_MASK                       equ 0003h
CTMUCON2_ITRIM_POSN                      equ 0002h
CTMUCON2_ITRIM_POSITION                  equ 0002h
CTMUCON2_ITRIM_SIZE                      equ 0006h
CTMUCON2_ITRIM_LENGTH                    equ 0006h
CTMUCON2_ITRIM_MASK                      equ 00FCh
CTMUCON2_IRNG0_POSN                      equ 0000h
CTMUCON2_IRNG0_POSITION                  equ 0000h
CTMUCON2_IRNG0_SIZE                      equ 0001h
CTMUCON2_IRNG0_LENGTH                    equ 0001h
CTMUCON2_IRNG0_MASK                      equ 0001h
CTMUCON2_IRNG1_POSN                      equ 0001h
CTMUCON2_IRNG1_POSITION                  equ 0001h
CTMUCON2_IRNG1_SIZE                      equ 0001h
CTMUCON2_IRNG1_LENGTH                    equ 0001h
CTMUCON2_IRNG1_MASK                      equ 0002h
CTMUCON2_ITRIM0_POSN                     equ 0002h
CTMUCON2_ITRIM0_POSITION                 equ 0002h
CTMUCON2_ITRIM0_SIZE                     equ 0001h
CTMUCON2_ITRIM0_LENGTH                   equ 0001h
CTMUCON2_ITRIM0_MASK                     equ 0004h
CTMUCON2_ITRIM1_POSN                     equ 0003h
CTMUCON2_ITRIM1_POSITION                 equ 0003h
CTMUCON2_ITRIM1_SIZE                     equ 0001h
CTMUCON2_ITRIM1_LENGTH                   equ 0001h
CTMUCON2_ITRIM1_MASK                     equ 0008h
CTMUCON2_ITRIM2_POSN                     equ 0004h
CTMUCON2_ITRIM2_POSITION                 equ 0004h
CTMUCON2_ITRIM2_SIZE                     equ 0001h
CTMUCON2_ITRIM2_LENGTH                   equ 0001h
CTMUCON2_ITRIM2_MASK                     equ 0010h
CTMUCON2_ITRIM3_POSN                     equ 0005h
CTMUCON2_ITRIM3_POSITION                 equ 0005h
CTMUCON2_ITRIM3_SIZE                     equ 0001h
CTMUCON2_ITRIM3_LENGTH                   equ 0001h
CTMUCON2_ITRIM3_MASK                     equ 0020h
CTMUCON2_ITRIM4_POSN                     equ 0006h
CTMUCON2_ITRIM4_POSITION                 equ 0006h
CTMUCON2_ITRIM4_SIZE                     equ 0001h
CTMUCON2_ITRIM4_LENGTH                   equ 0001h
CTMUCON2_ITRIM4_MASK                     equ 0040h
CTMUCON2_ITRIM5_POSN                     equ 0007h
CTMUCON2_ITRIM5_POSITION                 equ 0007h
CTMUCON2_ITRIM5_SIZE                     equ 0001h
CTMUCON2_ITRIM5_LENGTH                   equ 0001h
CTMUCON2_ITRIM5_MASK                     equ 0080h

// Register: CTMUCON1
#define CTMUCON1 CTMUCON1
CTMUCON1                                 equ 0EF8h
// bitfield definitions
CTMUCON1_CTTRIG_POSN                     equ 0000h
CTMUCON1_CTTRIG_POSITION                 equ 0000h
CTMUCON1_CTTRIG_SIZE                     equ 0001h
CTMUCON1_CTTRIG_LENGTH                   equ 0001h
CTMUCON1_CTTRIG_MASK                     equ 0001h
CTMUCON1_IDISSEN_POSN                    equ 0001h
CTMUCON1_IDISSEN_POSITION                equ 0001h
CTMUCON1_IDISSEN_SIZE                    equ 0001h
CTMUCON1_IDISSEN_LENGTH                  equ 0001h
CTMUCON1_IDISSEN_MASK                    equ 0002h
CTMUCON1_EDGSEQEN_POSN                   equ 0002h
CTMUCON1_EDGSEQEN_POSITION               equ 0002h
CTMUCON1_EDGSEQEN_SIZE                   equ 0001h
CTMUCON1_EDGSEQEN_LENGTH                 equ 0001h
CTMUCON1_EDGSEQEN_MASK                   equ 0004h
CTMUCON1_EDGEN_POSN                      equ 0003h
CTMUCON1_EDGEN_POSITION                  equ 0003h
CTMUCON1_EDGEN_SIZE                      equ 0001h
CTMUCON1_EDGEN_LENGTH                    equ 0001h
CTMUCON1_EDGEN_MASK                      equ 0008h
CTMUCON1_TGEN_POSN                       equ 0004h
CTMUCON1_TGEN_POSITION                   equ 0004h
CTMUCON1_TGEN_SIZE                       equ 0001h
CTMUCON1_TGEN_LENGTH                     equ 0001h
CTMUCON1_TGEN_MASK                       equ 0010h
CTMUCON1_CTMUSIDL_POSN                   equ 0005h
CTMUCON1_CTMUSIDL_POSITION               equ 0005h
CTMUCON1_CTMUSIDL_SIZE                   equ 0001h
CTMUCON1_CTMUSIDL_LENGTH                 equ 0001h
CTMUCON1_CTMUSIDL_MASK                   equ 0020h
CTMUCON1_CTMUEN_POSN                     equ 0007h
CTMUCON1_CTMUEN_POSITION                 equ 0007h
CTMUCON1_CTMUEN_SIZE                     equ 0001h
CTMUCON1_CTMUEN_LENGTH                   equ 0001h
CTMUCON1_CTMUEN_MASK                     equ 0080h

// Register: TXREG4
#define TXREG4 TXREG4
TXREG4                                   equ 0EF9h
// bitfield definitions
TXREG4_TXREG4_POSN                       equ 0000h
TXREG4_TXREG4_POSITION                   equ 0000h
TXREG4_TXREG4_SIZE                       equ 0008h
TXREG4_TXREG4_LENGTH                     equ 0008h
TXREG4_TXREG4_MASK                       equ 00FFh

