GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
// Register: RCSTA4
#define RCSTA4 RCSTA4
RCSTA4                                   equ 0EFFh
// bitfield definitions
RCSTA4_RX9D_POSN                         equ 0000h
RCSTA4_RX9D_POSITION                     equ 0000h
RCSTA4_RX9D_SIZE                         equ 0001h
RCSTA4_RX9D_LENGTH                       equ 0001h
RCSTA4_RX9D_MASK                         equ 0001h
RCSTA4_OERR_POSN                         equ 0001h
RCSTA4_OERR_POSITION                     equ 0001h
RCSTA4_OERR_SIZE                         equ 0001h
RCSTA4_OERR_LENGTH                       equ 0001h
RCSTA4_OERR_MASK                         equ 0002h
RCSTA4_FERR_POSN                         equ 0002h
RCSTA4_FERR_POSITION                     equ 0002h
RCSTA4_FERR_SIZE                         equ 0001h
RCSTA4_FERR_LENGTH                       equ 0001h
RCSTA4_FERR_MASK                         equ 0004h
RCSTA4_ADDEN_POSN                        equ 0003h
RCSTA4_ADDEN_POSITION                    equ 0003h
RCSTA4_ADDEN_SIZE                        equ 0001h
RCSTA4_ADDEN_LENGTH                      equ 0001h
RCSTA4_ADDEN_MASK                        equ 0008h
RCSTA4_CREN_POSN                         equ 0004h
RCSTA4_CREN_POSITION                     equ 0004h
RCSTA4_CREN_SIZE                         equ 0001h
RCSTA4_CREN_LENGTH                       equ 0001h
RCSTA4_CREN_MASK                         equ 0010h
RCSTA4_SREN_POSN                         equ 0005h
RCSTA4_SREN_POSITION                     equ 0005h
RCSTA4_SREN_SIZE                         equ 0001h
RCSTA4_SREN_LENGTH                       equ 0001h
RCSTA4_SREN_MASK                         equ 0020h
RCSTA4_RX9_POSN                          equ 0006h
RCSTA4_RX9_POSITION                      equ 0006h
RCSTA4_RX9_SIZE                          equ 0001h
RCSTA4_RX9_LENGTH                        equ 0001h
RCSTA4_RX9_MASK                          equ 0040h
RCSTA4_SPEN_POSN                         equ 0007h
RCSTA4_SPEN_POSITION                     equ 0007h
RCSTA4_SPEN_SIZE                         equ 0001h
RCSTA4_SPEN_LENGTH                       equ 0001h
RCSTA4_SPEN_MASK                         equ 0080h
RCSTA4_RCD84_POSN                        equ 0000h
RCSTA4_RCD84_POSITION                    equ 0000h
RCSTA4_RCD84_SIZE                        equ 0001h
RCSTA4_RCD84_LENGTH                      equ 0001h
RCSTA4_RCD84_MASK                        equ 0001h
RCSTA4_RC8_92_POSN                       equ 0006h
RCSTA4_RC8_92_POSITION                   equ 0006h
RCSTA4_RC8_92_SIZE                       equ 0001h
RCSTA4_RC8_92_LENGTH                     equ 0001h
RCSTA4_RC8_92_MASK                       equ 0040h
RCSTA4_RC94_POSN                         equ 0006h
RCSTA4_RC94_POSITION                     equ 0006h
RCSTA4_RC94_SIZE                         equ 0001h
RCSTA4_RC94_LENGTH                       equ 0001h
RCSTA4_RC94_MASK                         equ 0040h

// Register: DMACON2
#define DMACON2 DMACON2
DMACON2                                  equ 0F00h
// bitfield definitions
DMACON2_INTLVL_POSN                      equ 0000h
DMACON2_INTLVL_POSITION                  equ 0000h
DMACON2_INTLVL_SIZE                      equ 0004h
DMACON2_INTLVL_LENGTH                    equ 0004h
DMACON2_INTLVL_MASK                      equ 000Fh
DMACON2_DLYCYC_POSN                      equ 0004h
DMACON2_DLYCYC_POSITION                  equ 0004h
DMACON2_DLYCYC_SIZE                      equ 0004h
DMACON2_DLYCYC_LENGTH                    equ 0004h
DMACON2_DLYCYC_MASK                      equ 00F0h
DMACON2_INTLVL0_POSN                     equ 0000h
DMACON2_INTLVL0_POSITION                 equ 0000h
DMACON2_INTLVL0_SIZE                     equ 0001h
DMACON2_INTLVL0_LENGTH                   equ 0001h
DMACON2_INTLVL0_MASK                     equ 0001h
DMACON2_INTLVL1_POSN                     equ 0001h
DMACON2_INTLVL1_POSITION                 equ 0001h
DMACON2_INTLVL1_SIZE                     equ 0001h
DMACON2_INTLVL1_LENGTH                   equ 0001h
DMACON2_INTLVL1_MASK                     equ 0002h
DMACON2_INTLVL2_POSN                     equ 0002h
DMACON2_INTLVL2_POSITION                 equ 0002h
DMACON2_INTLVL2_SIZE                     equ 0001h
DMACON2_INTLVL2_LENGTH                   equ 0001h
DMACON2_INTLVL2_MASK                     equ 0004h
DMACON2_INTLVL3_POSN                     equ 0003h
DMACON2_INTLVL3_POSITION                 equ 0003h
DMACON2_INTLVL3_SIZE                     equ 0001h
DMACON2_INTLVL3_LENGTH                   equ 0001h
DMACON2_INTLVL3_MASK                     equ 0008h
DMACON2_DLYCYC0_POSN                     equ 0004h
DMACON2_DLYCYC0_POSITION                 equ 0004h
DMACON2_DLYCYC0_SIZE                     equ 0001h
DMACON2_DLYCYC0_LENGTH                   equ 0001h
DMACON2_DLYCYC0_MASK                     equ 0010h
DMACON2_DLYCYC1_POSN                     equ 0005h
DMACON2_DLYCYC1_POSITION                 equ 0005h
DMACON2_DLYCYC1_SIZE                     equ 0001h
DMACON2_DLYCYC1_LENGTH                   equ 0001h
DMACON2_DLYCYC1_MASK                     equ 0020h
DMACON2_DLYCYC2_POSN                     equ 0006h
DMACON2_DLYCYC2_POSITION                 equ 0006h
DMACON2_DLYCYC2_SIZE                     equ 0001h
DMACON2_DLYCYC2_LENGTH                   equ 0001h
DMACON2_DLYCYC2_MASK                     equ 0040h
DMACON2_DLYCYC3_POSN                     equ 0007h
DMACON2_DLYCYC3_POSITION                 equ 0007h
DMACON2_DLYCYC3_SIZE                     equ 0001h
DMACON2_DLYCYC3_LENGTH                   equ 0001h
DMACON2_DLYCYC3_MASK                     equ 0080h

// Register: ANCFG
#define ANCFG ANCFG
ANCFG                                    equ 0F01h
// bitfield definitions
ANCFG_VBGEN_POSN                         equ 0000h
ANCFG_VBGEN_POSITION                     equ 0000h
ANCFG_VBGEN_SIZE                         equ 0001h
ANCFG_VBGEN_LENGTH                       equ 0001h
ANCFG_VBGEN_MASK                         equ 0001h
ANCFG_VBG2EN_POSN                        equ 0001h
ANCFG_VBG2EN_POSITION                    equ 0001h
ANCFG_VBG2EN_SIZE                        equ 0001h
ANCFG_VBG2EN_LENGTH                      equ 0001h
ANCFG_VBG2EN_MASK                        equ 0002h
ANCFG_VBG6EN_POSN                        equ 0002h
ANCFG_VBG6EN_POSITION                    equ 0002h
ANCFG_VBG6EN_SIZE                        equ 0001h
ANCFG_VBG6EN_LENGTH                      equ 0001h
ANCFG_VBG6EN_MASK                        equ 0004h

// Register: SSP2ADD
#define SSP2ADD SSP2ADD
SSP2ADD                                  equ 0F02h
// bitfield definitions
SSP2ADD_SSPADD_POSN                      equ 0000h
SSP2ADD_SSPADD_POSITION                  equ 0000h
SSP2ADD_SSPADD_SIZE                      equ 0008h
SSP2ADD_SSPADD_LENGTH                    equ 0008h
SSP2ADD_SSPADD_MASK                      equ 00FFh
SSP2ADD_MSK02_POSN                       equ 0000h
SSP2ADD_MSK02_POSITION                   equ 0000h
SSP2ADD_MSK02_SIZE                       equ 0001h
SSP2ADD_MSK02_LENGTH                     equ 0001h
SSP2ADD_MSK02_MASK                       equ 0001h
SSP2ADD_MSK12_POSN                       equ 0001h
SSP2ADD_MSK12_POSITION                   equ 0001h
SSP2ADD_MSK12_SIZE                       equ 0001h
SSP2ADD_MSK12_LENGTH                     equ 0001h
SSP2ADD_MSK12_MASK                       equ 0002h
SSP2ADD_MSK22_POSN                       equ 0002h
SSP2ADD_MSK22_POSITION                   equ 0002h
SSP2ADD_MSK22_SIZE                       equ 0001h
SSP2ADD_MSK22_LENGTH                     equ 0001h
SSP2ADD_MSK22_MASK                       equ 0004h
SSP2ADD_MSK32_POSN                       equ 0003h
SSP2ADD_MSK32_POSITION                   equ 0003h
SSP2ADD_MSK32_SIZE                       equ 0001h
SSP2ADD_MSK32_LENGTH                     equ 0001h
SSP2ADD_MSK32_MASK                       equ 0008h
SSP2ADD_MSK42_POSN                       equ 0004h
SSP2ADD_MSK42_POSITION                   equ 0004h
SSP2ADD_MSK42_SIZE                       equ 0001h
SSP2ADD_MSK42_LENGTH                     equ 0001h
SSP2ADD_MSK42_MASK                       equ 0010h
SSP2ADD_MSK52_POSN                       equ 0005h
SSP2ADD_MSK52_POSITION                   equ 0005h
SSP2ADD_MSK52_SIZE                       equ 0001h
SSP2ADD_MSK52_LENGTH                     equ 0001h
SSP2ADD_MSK52_MASK                       equ 0020h
SSP2ADD_MSK62_POSN                       equ 0006h
SSP2ADD_MSK62_POSITION                   equ 0006h
SSP2ADD_MSK62_SIZE                       equ 0001h
SSP2ADD_MSK62_LENGTH                     equ 0001h
SSP2ADD_MSK62_MASK                       equ 0040h
SSP2ADD_MSK72_POSN                       equ 0007h
SSP2ADD_MSK72_POSITION                   equ 0007h
SSP2ADD_MSK72_SIZE                       equ 0001h
SSP2ADD_MSK72_LENGTH                     equ 0001h
SSP2ADD_MSK72_MASK                       equ 0080h
SSP2ADD_MSK0_POSN                        equ 0000h
SSP2ADD_MSK0_POSITION                    equ 0000h
SSP2ADD_MSK0_SIZE                        equ 0001h
SSP2ADD_MSK0_LENGTH                      equ 0001h
SSP2ADD_MSK0_MASK                        equ 0001h
SSP2ADD_MSK1_POSN                        equ 0001h
SSP2ADD_MSK1_POSITION                    equ 0001h
SSP2ADD_MSK1_SIZE                        equ 0001h
SSP2ADD_MSK1_LENGTH                      equ 0001h
SSP2ADD_MSK1_MASK                        equ 0002h
SSP2ADD_MSK2_POSN                        equ 0002h
SSP2ADD_MSK2_POSITION                    equ 0002h
SSP2ADD_MSK2_SIZE                        equ 0001h
SSP2ADD_MSK2_LENGTH                      equ 0001h
SSP2ADD_MSK2_MASK                        equ 0004h
SSP2ADD_MSK3_POSN                        equ 0003h
SSP2ADD_MSK3_POSITION                    equ 0003h
SSP2ADD_MSK3_SIZE                        equ 0001h
SSP2ADD_MSK3_LENGTH                      equ 0001h
SSP2ADD_MSK3_MASK                        equ 0008h
SSP2ADD_MSK4_POSN                        equ 0004h
SSP2ADD_MSK4_POSITION                    equ 0004h
SSP2ADD_MSK4_SIZE                        equ 0001h
SSP2ADD_MSK4_LENGTH                      equ 0001h
SSP2ADD_MSK4_MASK                        equ 0010h
SSP2ADD_MSK5_POSN                        equ 0005h
SSP2ADD_MSK5_POSITION                    equ 0005h
SSP2ADD_MSK5_SIZE                        equ 0001h
SSP2ADD_MSK5_LENGTH                      equ 0001h
SSP2ADD_MSK5_MASK                        equ 0020h
SSP2ADD_MSK6_POSN                        equ 0006h
SSP2ADD_MSK6_POSITION                    equ 0006h
SSP2ADD_MSK6_SIZE                        equ 0001h
SSP2ADD_MSK6_LENGTH                      equ 0001h
SSP2ADD_MSK6_MASK                        equ 0040h
SSP2ADD_MSK7_POSN                        equ 0007h
SSP2ADD_MSK7_POSITION                    equ 0007h
SSP2ADD_MSK7_SIZE                        equ 0001h
SSP2ADD_MSK7_LENGTH                      equ 0001h
SSP2ADD_MSK7_MASK                        equ 0080h

// Register: SSP2BUF
#define SSP2BUF SSP2BUF
SSP2BUF                                  equ 0F03h
// bitfield definitions
SSP2BUF_SSPBUF_POSN                      equ 0000h
SSP2BUF_SSPBUF_POSITION                  equ 0000h
SSP2BUF_SSPBUF_SIZE                      equ 0008h
SSP2BUF_SSPBUF_LENGTH                    equ 0008h
SSP2BUF_SSPBUF_MASK                      equ 00FFh

// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 0F04h
// bitfield definitions
T4CON_T4CKPS_POSN                        equ 0000h
T4CON_T4CKPS_POSITION                    equ 0000h
T4CON_T4CKPS_SIZE                        equ 0002h
T4CON_T4CKPS_LENGTH                      equ 0002h
T4CON_T4CKPS_MASK                        equ 0003h
T4CON_TMR4ON_POSN                        equ 0002h
T4CON_TMR4ON_POSITION                    equ 0002h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0004h
T4CON_T4OUTPS_POSN                       equ 0003h
T4CON_T4OUTPS_POSITION                   equ 0003h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 0078h
T4CON_T4CKPS0_POSN                       equ 0000h
T4CON_T4CKPS0_POSITION                   equ 0000h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0001h
T4CON_T4CKPS1_POSN                       equ 0001h
T4CON_T4CKPS1_POSITION                   equ 0001h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0002h
T4CON_T4OUTPS0_POSN                      equ 0003h
T4CON_T4OUTPS0_POSITION                  equ 0003h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0008h
T4CON_T4OUTPS1_POSN                      equ 0004h
T4CON_T4OUTPS1_POSITION                  equ 0004h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0010h
T4CON_T4OUTPS2_POSN                      equ 0005h
T4CON_T4OUTPS2_POSITION                  equ 0005h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0020h
T4CON_T4OUTPS3_POSN                      equ 0006h
T4CON_T4OUTPS3_POSITION                  equ 0006h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0040h

// Register: PR4
#define PR4 PR4
PR4                                      equ 0F05h
// bitfield definitions
PR4_PR4_POSN                             equ 0000h
PR4_PR4_POSITION                         equ 0000h
PR4_PR4_SIZE                             equ 0008h
PR4_PR4_LENGTH                           equ 0008h
PR4_PR4_MASK                             equ 00FFh

// Register: TMR4
#define TMR4 TMR4
TMR4                                     equ 0F06h
// bitfield definitions
TMR4_TMR4_POSN                           equ 0000h
TMR4_TMR4_POSITION                       equ 0000h
TMR4_TMR4_SIZE                           equ 0008h
TMR4_TMR4_LENGTH                         equ 0008h
TMR4_TMR4_MASK                           equ 00FFh

// Register: CCP7CON
#define CCP7CON CCP7CON
CCP7CON                                  equ 0F07h
// bitfield definitions
CCP7CON_CCP7M_POSN                       equ 0000h
CCP7CON_CCP7M_POSITION                   equ 0000h
CCP7CON_CCP7M_SIZE                       equ 0004h
CCP7CON_CCP7M_LENGTH                     equ 0004h
CCP7CON_CCP7M_MASK                       equ 000Fh
CCP7CON_DC7B_POSN                        equ 0004h
CCP7CON_DC7B_POSITION                    equ 0004h
CCP7CON_DC7B_SIZE                        equ 0002h
CCP7CON_DC7B_LENGTH                      equ 0002h
CCP7CON_DC7B_MASK                        equ 0030h
CCP7CON_CCP7M0_POSN                      equ 0000h
CCP7CON_CCP7M0_POSITION                  equ 0000h
CCP7CON_CCP7M0_SIZE                      equ 0001h
CCP7CON_CCP7M0_LENGTH                    equ 0001h
CCP7CON_CCP7M0_MASK                      equ 0001h
CCP7CON_CCP7M1_POSN                      equ 0001h
CCP7CON_CCP7M1_POSITION                  equ 0001h
CCP7CON_CCP7M1_SIZE                      equ 0001h
CCP7CON_CCP7M1_LENGTH                    equ 0001h
CCP7CON_CCP7M1_MASK                      equ 0002h
CCP7CON_CCP7M2_POSN                      equ 0002h
CCP7CON_CCP7M2_POSITION                  equ 0002h
CCP7CON_CCP7M2_SIZE                      equ 0001h
CCP7CON_CCP7M2_LENGTH                    equ 0001h
CCP7CON_CCP7M2_MASK                      equ 0004h
CCP7CON_CCP7M3_POSN                      equ 0003h
CCP7CON_CCP7M3_POSITION                  equ 0003h
CCP7CON_CCP7M3_SIZE                      equ 0001h
CCP7CON_CCP7M3_LENGTH                    equ 0001h
CCP7CON_CCP7M3_MASK                      equ 0008h
CCP7CON_DC7B0_POSN                       equ 0004h
CCP7CON_DC7B0_POSITION                   equ 0004h
CCP7CON_DC7B0_SIZE                       equ 0001h
CCP7CON_DC7B0_LENGTH                     equ 0001h
CCP7CON_DC7B0_MASK                       equ 0010h
CCP7CON_DC7B1_POSN                       equ 0005h
CCP7CON_DC7B1_POSITION                   equ 0005h
CCP7CON_DC7B1_SIZE                       equ 0001h
CCP7CON_DC7B1_LENGTH                     equ 0001h
CCP7CON_DC7B1_MASK                       equ 0020h
CCP7CON_CCP7Y_POSN                       equ 0004h
CCP7CON_CCP7Y_POSITION                   equ 0004h
CCP7CON_CCP7Y_SIZE                       equ 0001h
CCP7CON_CCP7Y_LENGTH                     equ 0001h
CCP7CON_CCP7Y_MASK                       equ 0010h
CCP7CON_CCP7X_POSN                       equ 0005h
CCP7CON_CCP7X_POSITION                   equ 0005h
CCP7CON_CCP7X_SIZE                       equ 0001h
CCP7CON_CCP7X_LENGTH                     equ 0001h
CCP7CON_CCP7X_MASK                       equ 0020h

