GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
#define EPCONDIS14                       BANKMASK(UEP14), 3, b
#define EPCONDIS15                       BANKMASK(UEP15), 3, b
#define EPCONDIS2                        BANKMASK(UEP2), 3, b
#define EPCONDIS3                        BANKMASK(UEP3), 3, b
#define EPCONDIS4                        BANKMASK(UEP4), 3, b
#define EPCONDIS5                        BANKMASK(UEP5), 3, b
#define EPCONDIS6                        BANKMASK(UEP6), 3, b
#define EPCONDIS7                        BANKMASK(UEP7), 3, b
#define EPCONDIS8                        BANKMASK(UEP8), 3, b
#define EPCONDIS9                        BANKMASK(UEP9), 3, b
#define EPHSHK0                          BANKMASK(UEP0), 4, b
#define EPHSHK1                          BANKMASK(UEP1), 4, b
#define EPHSHK10                         BANKMASK(UEP10), 4, b
#define EPHSHK11                         BANKMASK(UEP11), 4, b
#define EPHSHK12                         BANKMASK(UEP12), 4, b
#define EPHSHK13                         BANKMASK(UEP13), 4, b
#define EPHSHK14                         BANKMASK(UEP14), 4, b
#define EPHSHK15                         BANKMASK(UEP15), 4, b
#define EPHSHK2                          BANKMASK(UEP2), 4, b
#define EPHSHK3                          BANKMASK(UEP3), 4, b
#define EPHSHK4                          BANKMASK(UEP4), 4, b
#define EPHSHK5                          BANKMASK(UEP5), 4, b
#define EPHSHK6                          BANKMASK(UEP6), 4, b
#define EPHSHK7                          BANKMASK(UEP7), 4, b
#define EPHSHK8                          BANKMASK(UEP8), 4, b
#define EPHSHK9                          BANKMASK(UEP9), 4, b
#define EPINEN0                          BANKMASK(UEP0), 1, b
#define EPINEN1                          BANKMASK(UEP1), 1, b
#define EPINEN10                         BANKMASK(UEP10), 1, b
#define EPINEN11                         BANKMASK(UEP11), 1, b
#define EPINEN12                         BANKMASK(UEP12), 1, b
#define EPINEN13                         BANKMASK(UEP13), 1, b
#define EPINEN14                         BANKMASK(UEP14), 1, b
#define EPINEN15                         BANKMASK(UEP15), 1, b
#define EPINEN2                          BANKMASK(UEP2), 1, b
#define EPINEN3                          BANKMASK(UEP3), 1, b
#define EPINEN4                          BANKMASK(UEP4), 1, b
#define EPINEN5                          BANKMASK(UEP5), 1, b
#define EPINEN6                          BANKMASK(UEP6), 1, b
#define EPINEN7                          BANKMASK(UEP7), 1, b
#define EPINEN8                          BANKMASK(UEP8), 1, b
#define EPINEN9                          BANKMASK(UEP9), 1, b
#define EPOUTEN0                         BANKMASK(UEP0), 2, b
#define EPOUTEN1                         BANKMASK(UEP1), 2, b
#define EPOUTEN10                        BANKMASK(UEP10), 2, b
#define EPOUTEN11                        BANKMASK(UEP11), 2, b
#define EPOUTEN12                        BANKMASK(UEP12), 2, b
#define EPOUTEN13                        BANKMASK(UEP13), 2, b
#define EPOUTEN14                        BANKMASK(UEP14), 2, b
#define EPOUTEN15                        BANKMASK(UEP15), 2, b
#define EPOUTEN2                         BANKMASK(UEP2), 2, b
#define EPOUTEN3                         BANKMASK(UEP3), 2, b
#define EPOUTEN4                         BANKMASK(UEP4), 2, b
#define EPOUTEN5                         BANKMASK(UEP5), 2, b
#define EPOUTEN6                         BANKMASK(UEP6), 2, b
#define EPOUTEN7                         BANKMASK(UEP7), 2, b
#define EPOUTEN8                         BANKMASK(UEP8), 2, b
#define EPOUTEN9                         BANKMASK(UEP9), 2, b
#define EPSTALL0                         BANKMASK(UEP0), 0, b
#define EPSTALL1                         BANKMASK(UEP1), 0, b
#define EPSTALL10                        BANKMASK(UEP10), 0, b
#define EPSTALL11                        BANKMASK(UEP11), 0, b
#define EPSTALL12                        BANKMASK(UEP12), 0, b
#define EPSTALL13                        BANKMASK(UEP13), 0, b
#define EPSTALL14                        BANKMASK(UEP14), 0, b
#define EPSTALL15                        BANKMASK(UEP15), 0, b
#define EPSTALL2                         BANKMASK(UEP2), 0, b
#define EPSTALL3                         BANKMASK(UEP3), 0, b
#define EPSTALL4                         BANKMASK(UEP4), 0, b
#define EPSTALL5                         BANKMASK(UEP5), 0, b
#define EPSTALL6                         BANKMASK(UEP6), 0, b
#define EPSTALL7                         BANKMASK(UEP7), 0, b
#define EPSTALL8                         BANKMASK(UEP8), 0, b
#define EPSTALL9                         BANKMASK(UEP9), 0, b
#define EVPOL01                          BANKMASK(CM1CON), 3, b
#define EVPOL02                          BANKMASK(CM2CON), 3, b
#define EVPOL03                          BANKMASK(CM3CON), 3, b
#define EVPOL11                          BANKMASK(CM1CON), 4, b
#define EVPOL12                          BANKMASK(CM2CON), 4, b
#define EVPOL13                          BANKMASK(CM3CON), 4, b
#define EVPOL15                          BANKMASK(IPR5), 4, a
#define EXTR                             BANKMASK(RCON2), 7, a
#define EXTSAM                           BANKMASK(ADCON3H), 6, b
#define FLT0R0                           BANKMASK(RPINR14_15), 0, b
#define FLT0R1                           BANKMASK(RPINR14_15), 1, b
#define FLT0R2                           BANKMASK(RPINR14_15), 2, b
#define FLT0R3                           BANKMASK(RPINR14_15), 3, b
#define FORM0                            BANKMASK(ADCON1H), 0, a
#define FORM1                            BANKMASK(ADCON1H), 1, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FRM0                             BANKMASK(UFRML), 0, a
#define FRM1                             BANKMASK(UFRML), 1, a
#define FRM10                            BANKMASK(UFRMH), 2, a
#define FRM2                             BANKMASK(UFRML), 2, a
#define FRM3                             BANKMASK(UFRML), 3, a
#define FRM4                             BANKMASK(UFRML), 4, a
#define FRM5                             BANKMASK(UFRML), 5, a
#define FRM6                             BANKMASK(UFRML), 6, a
#define FRM7                             BANKMASK(UFRML), 7, a
#define FRM8                             BANKMASK(UFRMH), 0, a
#define FRM9                             BANKMASK(UFRMH), 1, a
#define FSEN                             BANKMASK(UCFG), 2, b
#define GCEN1                            BANKMASK(SSP1CON2), 7, a
#define GCEN2                            BANKMASK(SSP2CON2), 7, b
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define HALFSEC                          BANKMASK(RTCCON1), 3, b
#define HLVDEN                           BANKMASK(HLVDCON), 4, a
#define HLVDIE                           BANKMASK(PIE2), 2, a
#define HLVDIF                           BANKMASK(PIR2), 2, a
#define HLVDIP                           BANKMASK(IPR2), 2, a
#define HLVDL0                           BANKMASK(HLVDCON), 0, a
#define HLVDL1                           BANKMASK(HLVDCON), 1, a
#define HLVDL2                           BANKMASK(HLVDCON), 2, a
#define HLVDL3                           BANKMASK(HLVDCON), 3, a
#define I2C_DAT1                         BANKMASK(SSP1STAT), 5, a
#define I2C_DAT2                         BANKMASK(SSP2STAT), 5, b
#define I2C_READ1                        BANKMASK(SSP1STAT), 2, a
#define I2C_READ2                        BANKMASK(SSP2STAT), 2, b
#define I2C_START1                       BANKMASK(SSP1STAT), 3, a
#define I2C_START2                       BANKMASK(SSP2STAT), 3, b
#define IBF                              BANKMASK(PSPCON), 7, a
#define IBOV                             BANKMASK(PSPCON), 5, a
#define IDISSEN                          BANKMASK(CTMUCON1), 1, b
#define IDLEIE                           BANKMASK(UIE), 4, b
#define IDLEIF                           BANKMASK(UIR), 4, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT1R0                           BANKMASK(RPINR26_27), 0, b
#define INT1R1                           BANKMASK(RPINR26_27), 1, b
#define INT1R2                           BANKMASK(RPINR26_27), 2, b
#define INT1R3                           BANKMASK(RPINR26_27), 3, b
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INT2R0                           BANKMASK(RPINR26_27), 4, b
#define INT2R1                           BANKMASK(RPINR26_27), 5, b
#define INT2R2                           BANKMASK(RPINR26_27), 6, b
#define INT2R3                           BANKMASK(RPINR26_27), 7, b
#define INT3E                            BANKMASK(INTCON3), 5, a
#define INT3F                            BANKMASK(INTCON3), 2, a
#define INT3IE                           BANKMASK(INTCON3), 5, a
#define INT3IF                           BANKMASK(INTCON3), 2, a
#define INT3IP                           BANKMASK(INTCON2), 1, a
#define INT3P                            BANKMASK(INTCON2), 1, a
#define INT3R0                           BANKMASK(RPINR28_29), 0, b
#define INT3R1                           BANKMASK(RPINR28_29), 1, b
#define INT3R2                           BANKMASK(RPINR28_29), 2, b
#define INT3R3                           BANKMASK(RPINR28_29), 3, b
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTEDG3                          BANKMASK(INTCON2), 3, a
#define INTLVL0                          BANKMASK(DMACON2), 0, b
#define INTLVL1                          BANKMASK(DMACON2), 1, b
#define INTLVL2                          BANKMASK(DMACON2), 2, b
#define INTLVL3                          BANKMASK(DMACON2), 3, b
#define IOC0R0                           BANKMASK(RPINR18_19), 0, b
#define IOC0R1                           BANKMASK(RPINR18_19), 1, b
#define IOC0R2                           BANKMASK(RPINR18_19), 2, b
#define IOC0R3                           BANKMASK(RPINR18_19), 3, b
#define IOC1R0                           BANKMASK(RPINR18_19), 4, b
#define IOC1R1                           BANKMASK(RPINR18_19), 5, b
#define IOC1R2                           BANKMASK(RPINR18_19), 6, b
#define IOC1R3                           BANKMASK(RPINR18_19), 7, b
#define IOC2R0                           BANKMASK(RPINR20_21), 0, b
#define IOC2R1                           BANKMASK(RPINR20_21), 1, b
#define IOC2R2                           BANKMASK(RPINR20_21), 2, b
#define IOC2R3                           BANKMASK(RPINR20_21), 3, b
#define IOC3R0                           BANKMASK(RPINR20_21), 4, b
#define IOC3R1                           BANKMASK(RPINR20_21), 5, b
#define IOC3R2                           BANKMASK(RPINR20_21), 6, b
#define IOC3R3                           BANKMASK(RPINR20_21), 7, b
#define IOC4R0                           BANKMASK(RPINR22_23), 0, b
#define IOC4R1                           BANKMASK(RPINR22_23), 1, b
#define IOC4R2                           BANKMASK(RPINR22_23), 2, b
#define IOC4R3                           BANKMASK(RPINR22_23), 3, b
#define IOC5R0                           BANKMASK(RPINR22_23), 4, b
#define IOC5R1                           BANKMASK(RPINR22_23), 5, b
#define IOC5R2                           BANKMASK(RPINR22_23), 6, b
#define IOC5R3                           BANKMASK(RPINR22_23), 7, b
#define IOC6R0                           BANKMASK(RPINR24_25), 0, b
#define IOC6R1                           BANKMASK(RPINR24_25), 1, b
#define IOC6R2                           BANKMASK(RPINR24_25), 2, b
#define IOC6R3                           BANKMASK(RPINR24_25), 3, b
#define IOC7R0                           BANKMASK(RPINR24_25), 4, b
#define IOC7R1                           BANKMASK(RPINR24_25), 5, b
#define IOC7R2                           BANKMASK(RPINR24_25), 6, b
#define IOC7R3                           BANKMASK(RPINR24_25), 7, b
#define IOCF0                            BANKMASK(IOCF), 0, a
#define IOCF1                            BANKMASK(IOCF), 1, a
#define IOCF2                            BANKMASK(IOCF), 2, a
#define IOCF3                            BANKMASK(IOCF), 3, a
#define IOCF4                            BANKMASK(IOCF), 4, a
#define IOCF5                            BANKMASK(IOCF), 5, a
#define IOCF6                            BANKMASK(IOCF), 6, a
#define IOCF7                            BANKMASK(IOCF), 7, a
#define IOCIE                            BANKMASK(INTCON), 3, a
#define IOCIF                            BANKMASK(INTCON), 0, a
#define IOCIP                            BANKMASK(INTCON2), 0, a
#define IOCMD                            BANKMASK(PMD4), 3, b
#define IOCN0                            BANKMASK(IOCN), 0, b
#define IOCN1                            BANKMASK(IOCN), 1, b
#define IOCN2                            BANKMASK(IOCN), 2, b
#define IOCN3                            BANKMASK(IOCN), 3, b
#define IOCN4                            BANKMASK(IOCN), 4, b
#define IOCN5                            BANKMASK(IOCN), 5, b
#define IOCN6                            BANKMASK(IOCN), 6, b
#define IOCN7                            BANKMASK(IOCN), 7, b
#define IOCP0                            BANKMASK(IOCP), 0, b
#define IOCP1                            BANKMASK(IOCP), 1, b
#define IOCP2                            BANKMASK(IOCP), 2, b
#define IOCP3                            BANKMASK(IOCP), 3, b
#define IOCP4                            BANKMASK(IOCP), 4, b
#define IOCP5                            BANKMASK(IOCP), 5, b
#define IOCP6                            BANKMASK(IOCP), 6, b
#define IOCP7                            BANKMASK(IOCP), 7, b
#define IOLOCK                           BANKMASK(OSCCON2), 6, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON3), 0, a
#define IRCF1                            BANKMASK(OSCCON3), 1, a
#define IRCF2                            BANKMASK(OSCCON3), 2, a
#define IRNG0                            BANKMASK(CTMUCON2), 0, b
#define IRNG1                            BANKMASK(CTMUCON2), 1, b
#define IRVST                            BANKMASK(HLVDCON), 5, a
#define ITRIM0                           BANKMASK(CTMUCON2), 2, b
#define ITRIM1                           BANKMASK(CTMUCON2), 3, b
#define ITRIM2                           BANKMASK(CTMUCON2), 4, b
#define ITRIM3                           BANKMASK(CTMUCON2), 5, b
#define ITRIM4                           BANKMASK(CTMUCON2), 6, b
#define ITRIM5                           BANKMASK(CTMUCON2), 7, b
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LATD0                            BANKMASK(LATD), 0, a
#define LATD1                            BANKMASK(LATD), 1, a
#define LATD2                            BANKMASK(LATD), 2, a
#define LATD3                            BANKMASK(LATD), 3, a
#define LATD4                            BANKMASK(LATD), 4, a
#define LATD5                            BANKMASK(LATD), 5, a
#define LATD6                            BANKMASK(LATD), 6, a
#define LATD7                            BANKMASK(LATD), 7, a
#define LATE0                            BANKMASK(LATE), 0, a
#define LATE1                            BANKMASK(LATE), 1, a
#define LATE2                            BANKMASK(LATE), 2, a
#define LATE3                            BANKMASK(LATE), 3, a
#define LATE4                            BANKMASK(LATE), 4, a
#define LATE5                            BANKMASK(LATE), 5, a
#define LATE6                            BANKMASK(LATE), 6, a
#define LATE7                            BANKMASK(LATE), 7, a
#define LATF2                            BANKMASK(LATF), 2, a
#define LATF3                            BANKMASK(LATF), 3, a
#define LATF4                            BANKMASK(LATF), 4, a
#define LATF5                            BANKMASK(LATF), 5, a
#define LATF6                            BANKMASK(LATF), 6, a
#define LATF7                            BANKMASK(LATF), 7, a
#define LATG0                            BANKMASK(LATG), 0, a
#define LATG1                            BANKMASK(LATG), 1, a
#define LATG2                            BANKMASK(LATG), 2, a
#define LATG3                            BANKMASK(LATG), 3, a
#define LATG4                            BANKMASK(LATG), 4, a
#define LATH0                            BANKMASK(LATH), 0, a
#define LATH1                            BANKMASK(LATH), 1, a
#define LATH2                            BANKMASK(LATH), 2, a
#define LATH3                            BANKMASK(LATH), 3, a
#define LATH4                            BANKMASK(LATH), 4, a
#define LATH5                            BANKMASK(LATH), 5, a
#define LATH6                            BANKMASK(LATH), 6, a
#define LATH7                            BANKMASK(LATH), 7, a
#define LATJ0                            BANKMASK(LATJ), 0, a
#define LATJ1                            BANKMASK(LATJ), 1, a
#define LATJ2                            BANKMASK(LATJ), 2, a
#define LATJ3                            BANKMASK(LATJ), 3, a
#define LATJ4                            BANKMASK(LATJ), 4, a
#define LATJ5                            BANKMASK(LATJ), 5, a
#define LATJ6                            BANKMASK(LATJ), 6, a
#define LATJ7                            BANKMASK(LATJ), 7, a
#define LATVP0                           BANKMASK(LATVP), 0, a
#define LATVP1                           BANKMASK(LATVP), 1, a
#define LATVP2                           BANKMASK(LATVP), 2, a
#define LATVP3                           BANKMASK(LATVP), 3, a
#define LATVP4                           BANKMASK(LATVP), 4, a
#define LATVP5                           BANKMASK(LATVP), 5, a
#define LATVP6                           BANKMASK(LATVP), 6, a
#define LATVP7                           BANKMASK(LATVP), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LCDA                             BANKMASK(LCDPS), 5, b
#define LCDCST0                          BANKMASK(LCDREF), 3, b
#define LCDCST1                          BANKMASK(LCDREF), 4, b
#define LCDCST2                          BANKMASK(LCDREF), 5, b
#define LCDEN                            BANKMASK(LCDCON), 7, b
#define LCDIE                            BANKMASK(PIE3), 6, a
#define LCDIF                            BANKMASK(PIR3), 6, a
#define LCDIP                            BANKMASK(IPR3), 6, a
#define LCDIRE                           BANKMASK(LCDREF), 7, b
#define LCDMD                            BANKMASK(PMD3), 3, b
#define LD0                              BANKMASK(LATD), 0, a
#define LD1                              BANKMASK(LATD), 1, a
#define LD2                              BANKMASK(LATD), 2, a
#define LD3                              BANKMASK(LATD), 3, a
#define LD4                              BANKMASK(LATD), 4, a
#define LD5                              BANKMASK(LATD), 5, a
#define LD6                              BANKMASK(LATD), 6, a
#define LD7                              BANKMASK(LATD), 7, a
#define LE0                              BANKMASK(LATE), 0, a
#define LE1                              BANKMASK(LATE), 1, a
#define LE2                              BANKMASK(LATE), 2, a
#define LE3                              BANKMASK(LATE), 3, a
#define LE4                              BANKMASK(LATE), 4, a
#define LE5                              BANKMASK(LATE), 5, a
#define LE6                              BANKMASK(LATE), 6, a
#define LE7                              BANKMASK(LATE), 7, a
#define LF2                              BANKMASK(LATF), 2, a
#define LF3                              BANKMASK(LATF), 3, a
#define LF4                              BANKMASK(LATF), 4, a
#define LF5                              BANKMASK(LATF), 5, a
#define LF6                              BANKMASK(LATF), 6, a
#define LF7                              BANKMASK(LATF), 7, a
#define LG0                              BANKMASK(LATG), 0, a
