GopalSaraf/Practicals/PSDL/include/proc/pic18f85j94.inc
#define S54C5                            BANKMASK(LCDDATA46), 6, b
#define S54C6                            BANKMASK(LCDDATA54), 6, b
#define S54C7                            BANKMASK(LCDDATA62), 6, b
#define S55C0                            BANKMASK(LCDDATA6), 7, b
#define S55C1                            BANKMASK(LCDDATA14), 7, b
#define S55C2                            BANKMASK(LCDDATA22), 7, b
#define S55C3                            BANKMASK(LCDDATA30), 7, b
#define S55C4                            BANKMASK(LCDDATA38), 7, b
#define S55C5                            BANKMASK(LCDDATA46), 7, b
#define S55C6                            BANKMASK(LCDDATA54), 7, b
#define S55C7                            BANKMASK(LCDDATA62), 7, b
#define S56C0                            BANKMASK(LCDDATA7), 0, b
#define S56C1                            BANKMASK(LCDDATA15), 0, b
#define S56C2                            BANKMASK(LCDDATA23), 0, b
#define S56C3                            BANKMASK(LCDDATA31), 0, b
#define S56C4                            BANKMASK(LCDDATA39), 0, b
#define S56C5                            BANKMASK(LCDDATA47), 0, b
#define S56C6                            BANKMASK(LCDDATA55), 0, b
#define S56C7                            BANKMASK(LCDDATA63), 0, b
#define S57C0                            BANKMASK(LCDDATA7), 1, b
#define S57C1                            BANKMASK(LCDDATA15), 1, b
#define S57C2                            BANKMASK(LCDDATA23), 1, b
#define S57C3                            BANKMASK(LCDDATA31), 1, b
#define S57C4                            BANKMASK(LCDDATA39), 1, b
#define S57C5                            BANKMASK(LCDDATA47), 1, b
#define S57C6                            BANKMASK(LCDDATA55), 1, b
#define S57C7                            BANKMASK(LCDDATA63), 1, b
#define S58C0                            BANKMASK(LCDDATA7), 2, b
#define S58C1                            BANKMASK(LCDDATA15), 2, b
#define S58C2                            BANKMASK(LCDDATA23), 2, b
#define S58C3                            BANKMASK(LCDDATA31), 2, b
#define S58C4                            BANKMASK(LCDDATA39), 2, b
#define S58C5                            BANKMASK(LCDDATA47), 2, b
#define S58C6                            BANKMASK(LCDDATA55), 2, b
#define S58C7                            BANKMASK(LCDDATA63), 2, b
#define S59C0                            BANKMASK(LCDDATA7), 3, b
#define S59C1                            BANKMASK(LCDDATA15), 3, b
#define S59C2                            BANKMASK(LCDDATA23), 3, b
#define S59C3                            BANKMASK(LCDDATA31), 3, b
#define S59C4                            BANKMASK(LCDDATA39), 3, b
#define S59C5                            BANKMASK(LCDDATA47), 3, b
#define S59C6                            BANKMASK(LCDDATA55), 3, b
#define S59C7                            BANKMASK(LCDDATA63), 3, b
#define S60C0                            BANKMASK(LCDDATA7), 4, b
#define S60C1                            BANKMASK(LCDDATA15), 4, b
#define S60C2                            BANKMASK(LCDDATA23), 4, b
#define S60C3                            BANKMASK(LCDDATA31), 4, b
#define S60C4                            BANKMASK(LCDDATA39), 4, b
#define S60C5                            BANKMASK(LCDDATA47), 4, b
#define S60C6                            BANKMASK(LCDDATA55), 4, b
#define S60C7                            BANKMASK(LCDDATA63), 4, b
#define S61C0                            BANKMASK(LCDDATA7), 5, b
#define S61C1                            BANKMASK(LCDDATA15), 5, b
#define S61C2                            BANKMASK(LCDDATA23), 5, b
#define S61C3                            BANKMASK(LCDDATA31), 5, b
#define S61C4                            BANKMASK(LCDDATA39), 5, b
#define S61C5                            BANKMASK(LCDDATA47), 5, b
#define S61C6                            BANKMASK(LCDDATA55), 5, b
#define S61C7                            BANKMASK(LCDDATA63), 5, b
#define S62C0                            BANKMASK(LCDDATA7), 6, b
#define S62C1                            BANKMASK(LCDDATA15), 6, b
#define S62C2                            BANKMASK(LCDDATA23), 6, b
#define S62C3                            BANKMASK(LCDDATA31), 6, b
#define S62C4                            BANKMASK(LCDDATA39), 6, b
#define S62C5                            BANKMASK(LCDDATA47), 6, b
#define S62C6                            BANKMASK(LCDDATA55), 6, b
#define S62C7                            BANKMASK(LCDDATA63), 6, b
#define S63C0                            BANKMASK(LCDDATA7), 7, b
#define S63C1                            BANKMASK(LCDDATA15), 7, b
#define S63C2                            BANKMASK(LCDDATA23), 7, b
#define S63C3                            BANKMASK(LCDDATA31), 7, b
#define S63C4                            BANKMASK(LCDDATA39), 7, b
#define S63C5                            BANKMASK(LCDDATA47), 7, b
#define S63C6                            BANKMASK(LCDDATA55), 7, b
#define S63C7                            BANKMASK(LCDDATA63), 7, b
#define SAMC0                            BANKMASK(ADCON3H), 0, b
#define SAMC1                            BANKMASK(ADCON3H), 1, b
#define SAMC2                            BANKMASK(ADCON3H), 2, b
#define SAMC3                            BANKMASK(ADCON3H), 3, b
#define SAMC4                            BANKMASK(ADCON3H), 4, b
#define SAMP                             BANKMASK(ADCON1L), 1, a
#define SCK1R0                           BANKMASK(RPINR8_9), 0, b
#define SCK1R1                           BANKMASK(RPINR8_9), 1, b
#define SCK1R2                           BANKMASK(RPINR8_9), 2, b
#define SCK1R3                           BANKMASK(RPINR8_9), 3, b
#define SCK2R0                           BANKMASK(RPINR10_11), 4, b
#define SCK2R1                           BANKMASK(RPINR10_11), 5, b
#define SCK2R2                           BANKMASK(RPINR10_11), 6, b
#define SCK2R3                           BANKMASK(RPINR10_11), 7, b
#define SCKP                             BANKMASK(BAUDCON1), 4, a
#define SCKP1                            BANKMASK(BAUDCON1), 4, a
#define SCKP2                            BANKMASK(BAUDCON2), 4, b
#define SCKP3                            BANKMASK(BAUDCON3), 4, b
#define SCKP4                            BANKMASK(BAUDCON4), 4, b
#define SCS                              BANKMASK(OSCCON), 0, a
#define SDI1R0                           BANKMASK(RPINR8_9), 4, b
#define SDI1R1                           BANKMASK(RPINR8_9), 5, b
#define SDI1R2                           BANKMASK(RPINR8_9), 6, b
#define SDI1R3                           BANKMASK(RPINR8_9), 7, b
#define SDI2R0                           BANKMASK(RPINR12_13), 0, b
#define SDI2R1                           BANKMASK(RPINR12_13), 1, b
#define SDI2R2                           BANKMASK(RPINR12_13), 2, b
#define SDI2R3                           BANKMASK(RPINR12_13), 3, b
#define SE0                              BANKMASK(UCON), 5, a
#define SE00                             BANKMASK(LCDSE0), 0, b
#define SE01                             BANKMASK(LCDSE0), 1, b
#define SE02                             BANKMASK(LCDSE0), 2, b
#define SE03                             BANKMASK(LCDSE0), 3, b
#define SE04                             BANKMASK(LCDSE0), 4, b
#define SE05                             BANKMASK(LCDSE0), 5, b
#define SE06                             BANKMASK(LCDSE0), 6, b
#define SE07                             BANKMASK(LCDSE0), 7, b
#define SE08                             BANKMASK(LCDSE1), 0, b
#define SE09                             BANKMASK(LCDSE1), 1, b
#define SE10                             BANKMASK(LCDSE1), 2, b
#define SE11                             BANKMASK(LCDSE1), 3, b
#define SE12                             BANKMASK(LCDSE1), 4, b
#define SE13                             BANKMASK(LCDSE1), 5, b
#define SE14                             BANKMASK(LCDSE1), 6, b
#define SE15                             BANKMASK(LCDSE1), 7, b
#define SE16                             BANKMASK(LCDSE2), 0, b
#define SE17                             BANKMASK(LCDSE2), 1, b
#define SE18                             BANKMASK(LCDSE2), 2, b
#define SE19                             BANKMASK(LCDSE2), 3, b
#define SE20                             BANKMASK(LCDSE2), 4, b
#define SE21                             BANKMASK(LCDSE2), 5, b
#define SE22                             BANKMASK(LCDSE2), 6, b
#define SE23                             BANKMASK(LCDSE2), 7, b
#define SE24                             BANKMASK(LCDSE3), 0, b
#define SE25                             BANKMASK(LCDSE3), 1, b
#define SE26                             BANKMASK(LCDSE3), 2, b
#define SE27                             BANKMASK(LCDSE3), 3, b
#define SE28                             BANKMASK(LCDSE3), 4, b
#define SE29                             BANKMASK(LCDSE3), 5, b
#define SE30                             BANKMASK(LCDSE3), 6, b
#define SE31                             BANKMASK(LCDSE3), 7, b
#define SE32                             BANKMASK(LCDSE4), 0, b
#define SE33                             BANKMASK(LCDSE4), 1, b
#define SE34                             BANKMASK(LCDSE4), 2, b
#define SE35                             BANKMASK(LCDSE4), 3, b
#define SE36                             BANKMASK(LCDSE4), 4, b
#define SE37                             BANKMASK(LCDSE4), 5, b
#define SE38                             BANKMASK(LCDSE4), 6, b
#define SE39                             BANKMASK(LCDSE4), 7, b
#define SE40                             BANKMASK(LCDSE5), 0, b
#define SE41                             BANKMASK(LCDSE5), 1, b
#define SE42                             BANKMASK(LCDSE5), 2, b
#define SE43                             BANKMASK(LCDSE5), 3, b
#define SE44                             BANKMASK(LCDSE5), 4, b
#define SE45                             BANKMASK(LCDSE5), 5, b
#define SE46                             BANKMASK(LCDSE5), 6, b
#define SE47                             BANKMASK(LCDSE5), 7, b
#define SE48                             BANKMASK(LCDSE6), 0, b
#define SE49                             BANKMASK(LCDSE6), 1, b
#define SE50                             BANKMASK(LCDSE6), 2, b
#define SE51                             BANKMASK(LCDSE6), 3, b
#define SE52                             BANKMASK(LCDSE6), 4, b
#define SE53                             BANKMASK(LCDSE6), 5, b
#define SE54                             BANKMASK(LCDSE6), 6, b
#define SE55                             BANKMASK(LCDSE6), 7, b
#define SE56                             BANKMASK(LCDSE7), 0, b
#define SE57                             BANKMASK(LCDSE7), 1, b
#define SE58                             BANKMASK(LCDSE7), 2, b
#define SE59                             BANKMASK(LCDSE7), 3, b
#define SE60                             BANKMASK(LCDSE7), 4, b
#define SE61                             BANKMASK(LCDSE7), 5, b
#define SE62                             BANKMASK(LCDSE7), 6, b
#define SE63                             BANKMASK(LCDSE7), 7, b
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, b
#define SENDB1                           BANKMASK(TXSTA1), 3, a
#define SLPEN                            BANKMASK(LCDCON), 6, b
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, b
#define SMPI0                            BANKMASK(ADCON2L), 2, b
#define SMPI1                            BANKMASK(ADCON2L), 3, b
#define SMPI2                            BANKMASK(ADCON2L), 4, b
#define SMPI3                            BANKMASK(ADCON2L), 5, b
#define SMPI4                            BANKMASK(ADCON2L), 6, b
#define SOFIE                            BANKMASK(UIE), 6, b
#define SOFIF                            BANKMASK(UIR), 6, a
#define SOSCEN1                          BANKMASK(T1CON), 3, a
#define SOSCEN3                          BANKMASK(T3CON), 3, a
#define SOSCEN5                          BANKMASK(T5CON), 3, b
#define SOSCGO                           BANKMASK(OSCCON2), 1, a
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPI1MD                           BANKMASK(PMD0), 1, b
#define SPI2MD                           BANKMASK(PMD0), 2, b
#define SRENA                            BANKMASK(RCSTA1), 5, a
#define SRETEN                           BANKMASK(RCON4), 4, a
#define SS1R0                            BANKMASK(RPINR10_11), 0, b
#define SS1R1                            BANKMASK(RPINR10_11), 1, b
#define SS1R2                            BANKMASK(RPINR10_11), 2, b
#define SS1R3                            BANKMASK(RPINR10_11), 3, b
#define SS2                              BANKMASK(PORTD), 7, a
#define SS2R0                            BANKMASK(RPINR12_13), 4, b
#define SS2R1                            BANKMASK(RPINR12_13), 5, b
#define SS2R2                            BANKMASK(RPINR12_13), 6, b
#define SS2R3                            BANKMASK(RPINR12_13), 7, b
#define SSCON0                           BANKMASK(DMACON1), 6, a
#define SSCON1                           BANKMASK(DMACON1), 7, a
#define SSP1IE                           BANKMASK(PIE1), 3, a
#define SSP1IF                           BANKMASK(PIR1), 3, a
#define SSP1IP                           BANKMASK(IPR1), 3, a
#define SSP1MD                           BANKMASK(PMD1), 0, b
#define SSP1OD                           BANKMASK(ODCON1), 0, b
#define SSP2IE                           BANKMASK(PIE2), 6, a
#define SSP2IF                           BANKMASK(PIR2), 6, a
#define SSP2IP                           BANKMASK(IPR2), 6, a
#define SSP2MD                           BANKMASK(PMD1), 1, b
#define SSP2OD                           BANKMASK(ODCON1), 1, b
#define SSPEN1                           BANKMASK(SSP1CON1), 5, a
#define SSPEN2                           BANKMASK(SSP2CON1), 5, b
#define SSPM01                           BANKMASK(SSP1CON1), 0, a
#define SSPM012                          BANKMASK(LCDDATA12), 0, b
#define SSPM02                           BANKMASK(SSP2CON1), 0, b
#define SSPM11                           BANKMASK(SSP1CON1), 1, a
#define SSPM112                          BANKMASK(LCDDATA12), 1, b
#define SSPM12                           BANKMASK(SSP2CON1), 1, b
#define SSPM21                           BANKMASK(SSP1CON1), 2, a
#define SSPM212                          BANKMASK(LCDDATA12), 2, b
#define SSPM22                           BANKMASK(SSP2CON1), 2, b
#define SSPM31                           BANKMASK(SSP1CON1), 3, a
#define SSPM312                          BANKMASK(LCDDATA12), 3, b
#define SSPM32                           BANKMASK(SSP2CON1), 3, b
#define SSPOV1                           BANKMASK(SSP1CON1), 6, a
#define SSPOV2                           BANKMASK(SSP2CON1), 6, b
#define SSRC0                            BANKMASK(ADCON1L), 4, a
#define SSRC1                            BANKMASK(ADCON1L), 5, a
#define SSRC2                            BANKMASK(ADCON1L), 6, a
#define SSRC3                            BANKMASK(ADCON1L), 7, a
#define STALLIE                          BANKMASK(UIE), 5, b
#define STALLIF                          BANKMASK(UIR), 5, a
#define START1                           BANKMASK(SSP1STAT), 3, a
#define START2                           BANKMASK(SSP2STAT), 3, b
#define STKERR                           BANKMASK(RCON3), 7, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP1                            BANKMASK(SSP1STAT), 4, a
#define STOP2                            BANKMASK(SSP2STAT), 4, b
#define STRA1                            BANKMASK(PSTR1CON), 0, a
#define STRA2                            BANKMASK(PSTR2CON), 0, b
#define STRA3                            BANKMASK(PSTR3CON), 0, b
#define STRB1                            BANKMASK(PSTR1CON), 1, a
#define STRB2                            BANKMASK(PSTR2CON), 1, b
#define STRB3                            BANKMASK(PSTR3CON), 1, b
#define STRC1                            BANKMASK(PSTR1CON), 2, a
#define STRC2                            BANKMASK(PSTR2CON), 2, b
#define STRC3                            BANKMASK(PSTR3CON), 2, b
#define STRD1                            BANKMASK(PSTR1CON), 3, a
#define STRD2                            BANKMASK(PSTR2CON), 3, b
#define STRD3                            BANKMASK(PSTR3CON), 3, b
#define STRSYNC1                         BANKMASK(PSTR1CON), 4, a
#define STRSYNC2                         BANKMASK(PSTR2CON), 4, b
#define STRSYNC3                         BANKMASK(PSTR3CON), 4, b
#define SUSPND                           BANKMASK(UCON), 1, a
#define SWDTEN                           BANKMASK(RCON2), 5, a
#define SYNC1                            BANKMASK(TXSTA1), 4, a
#define T08BIT                           BANKMASK(T0CON), 6, a
#define T0CKIR0                          BANKMASK(RPINR38_39), 4, b
#define T0CKIR1                          BANKMASK(RPINR38_39), 5, b
#define T0CKIR2                          BANKMASK(RPINR38_39), 6, b
#define T0CKIR3                          BANKMASK(RPINR38_39), 7, b
#define T0CS0                            BANKMASK(T0CON), 4, a
#define T0CS1                            BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T1CKIR0                          BANKMASK(RPINR40_41), 4, b
#define T1CKIR1                          BANKMASK(RPINR40_41), 5, b
#define T1CKIR2                          BANKMASK(RPINR40_41), 6, b
#define T1CKIR3                          BANKMASK(RPINR40_41), 7, b
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GGO_NOT_T1DONE                 BANKMASK(T1GCON), 3, a
#define T1GGO_nT1DONE                    BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GR0                            BANKMASK(RPINR40_41), 0, b
#define T1GR1                            BANKMASK(RPINR40_41), 1, b
#define T1GR2                            BANKMASK(RPINR40_41), 2, b
#define T1GR3                            BANKMASK(RPINR40_41), 3, b
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GCON), 0, a
#define T1GSS1                           BANKMASK(T1GCON), 1, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T3CKIR0                          BANKMASK(RPINR42_43), 4, b
#define T3CKIR1                          BANKMASK(RPINR42_43), 5, b
#define T3CKIR2                          BANKMASK(RPINR42_43), 6, b
#define T3CKIR3                          BANKMASK(RPINR42_43), 7, b
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS019                        BANKMASK(LCDDATA19), 4, b
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CKPS119                        BANKMASK(LCDDATA19), 5, b
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_T3DONE                 BANKMASK(T3GCON), 3, a
#define T3GGO_nT3DONE                    BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GR0                            BANKMASK(RPINR42_43), 0, b
#define T3GR1                            BANKMASK(RPINR42_43), 1, b
#define T3GR2                            BANKMASK(RPINR42_43), 2, b
#define T3GR3                            BANKMASK(RPINR42_43), 3, b
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GCON), 0, a
#define T3GSS1                           BANKMASK(T3GCON), 1, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3OSCEN                          BANKMASK(T3CON), 3, a
#define T3RD16                           BANKMASK(T3CON), 7, a
#define T4CKPS0                          BANKMASK(T4CON), 0, b
#define T4CKPS016                        BANKMASK(LCDDATA16), 0, b
#define T4CKPS1                          BANKMASK(T4CON), 1, b
#define T4CKPS116                        BANKMASK(LCDDATA16), 1, b
#define T4OUTPS0                         BANKMASK(T4CON), 3, b
#define T4OUTPS016                       BANKMASK(LCDDATA16), 3, b
#define T4OUTPS1                         BANKMASK(T4CON), 4, b
#define T4OUTPS116                       BANKMASK(LCDDATA16), 4, b
#define T4OUTPS2                         BANKMASK(T4CON), 5, b
#define T4OUTPS216                       BANKMASK(LCDDATA16), 5, b
#define T4OUTPS3                         BANKMASK(T4CON), 6, b
#define T4OUTPS316                       BANKMASK(LCDDATA16), 6, b
#define T5CKIR0                          BANKMASK(RPINR44_45), 4, b
#define T5CKIR1                          BANKMASK(RPINR44_45), 5, b
#define T5CKIR2                          BANKMASK(RPINR44_45), 6, b
#define T5CKIR3                          BANKMASK(RPINR44_45), 7, b
#define T5CKPS0                          BANKMASK(T5CON), 4, b
#define T5CKPS1                          BANKMASK(T5CON), 5, b
#define T5GGO                            BANKMASK(T5GCON), 3, b
#define T5GGO_NOT_T5DONE                 BANKMASK(T5GCON), 3, b
#define T5GGO_nT5DONE                    BANKMASK(T5GCON), 3, b
#define T5GPOL                           BANKMASK(T5GCON), 6, b
#define T5GR0                            BANKMASK(RPINR44_45), 0, b
#define T5GR1                            BANKMASK(RPINR44_45), 1, b
#define T5GR2                            BANKMASK(RPINR44_45), 2, b
#define T5GR3                            BANKMASK(RPINR44_45), 3, b
#define T5GSPM                           BANKMASK(T5GCON), 4, b
#define T5GSS0                           BANKMASK(T5GCON), 0, b
#define T5GSS1                           BANKMASK(T5GCON), 1, b
#define T5GTM                            BANKMASK(T5GCON), 5, b
#define T5GVAL                           BANKMASK(T5GCON), 2, b
#define T5OSCEN                          BANKMASK(T5CON), 3, b
#define T5RD16                           BANKMASK(T5CON), 7, b
#define T6CKPS0                          BANKMASK(T6CON), 0, b
#define T6CKPS1                          BANKMASK(T6CON), 1, b
#define T6OUTPS0                         BANKMASK(T6CON), 3, b
#define T6OUTPS1                         BANKMASK(T6CON), 4, b
#define T6OUTPS2                         BANKMASK(T6CON), 5, b
#define T6OUTPS3                         BANKMASK(T6CON), 6, b
#define T8CKPS0                          BANKMASK(T8CON), 0, b
#define T8CKPS1                          BANKMASK(T8CON), 1, b
